{
    "dimensions": [
        {
            "description": "Breaks down reporting data by month and year in the network time zone. Can be used to filter on month using ISO 4601 format 'YYYY-MM'. Note: In v201802 and later, this dimension is compatible with the following time zone types: TimeZoneType.PUBLISHER TimeZoneType.PROPOSAL_LOCAL Corresponds to \"Month and year\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Partner finance.",
            "dimension": "MONTH_AND_YEAR"
        },
        {
            "description": "Breaks down reporting data by week of the year in the network time zone. Cannot be used for filtering. Note: In v201802 and later, this dimension is compatible with the following time zone types: TimeZoneType.PUBLISHER TimeZoneType.PROPOSAL_LOCAL Corresponds to \"Week\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "WEEK"
        },
        {
            "description": "Breaks down reporting data by date in the network time zone. Can be used to filter by date using ISO 8601's format 'YYYY-MM-DD'\". Note: In v201802 and later, this dimension is compatible with the following time zone types: TimeZoneType.PUBLISHER TimeZoneType.PROPOSAL_LOCAL Corresponds to \"Date\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales.",
            "dimension": "DATE"
        },
        {
            "description": "Breaks down reporting data by day of the week in the network time zone. Can be used to filter by day of the week using the index of the day (from 1 for Monday is 1 to 7 for Sunday). Corresponds to \"Day of week\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales.",
            "dimension": "DAY"
        },
        {
            "description": "Breaks down reporting data by hour of the day in the network time zone. Can be used to filter by hour of the day (from 0 to 23). Corresponds to \"Hour\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "HOUR"
        },
        {
            "description": "Breaks down reporting data by LineItem.id. Can be used to filter by LineItem.id. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "LINE_ITEM_ID"
        },
        {
            "description": "Breaks down reporting data by line item. LineItem.name and LineItem.id are automatically included as columns in the report. Can be used to filter by LineItem.name. Corresponds to \"Line item\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "LINE_ITEM_NAME"
        },
        {
            "description": "Breaks down reporting data by LineItem.lineItemType. Can be used to filter by line item type using LineItemType enumeration names. Corresponds to \"Line item type\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Data protection.",
            "dimension": "LINE_ITEM_TYPE"
        },
        {
            "description": "Breaks down reporting data by Order.id. Can be used to filter by Order.id. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "ORDER_ID"
        },
        {
            "description": "Breaks down reporting data by order. Order.name and Order.id are automatically included as columns in the report. Can be used to filter by Order.name. Corresponds to \"Order\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "ORDER_NAME"
        },
        {
            "description": "Delivery status of the order. Not available as a dimension to report on, but exists as a dimension in order to filter on it using PQL. Valid values are 'STARTED', 'NOT_STARTED' and 'COMPLETED'. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "ORDER_DELIVERY_STATUS"
        },
        {
            "description": "Breaks down reporting data by advertising company Company.id. Can be used to filter by Company.id. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "ADVERTISER_ID"
        },
        {
            "description": "Breaks down reporting data by advertising company. Company.name and Company.id are automatically included as columns in the report. Can be used to filter by Company.name. Corresponds to \"Advertiser\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "ADVERTISER_NAME"
        },
        {
            "description": "The network that provided the ad for SDK ad mediation. If selected for a report, that report will include only SDK mediation ads and will not contain non-SDK mediation ads. SDK mediation ads are ads for mobile devices. They have a list of ad networks which can provide ads to serve. Not every ad network will have an ad to serve so the device will try each network one-by-one until it finds an ad network with an ad to serve. The ad network that ends up serving the ad will appear here. Note that this id does not correlate to anything in the companies table and is not the same id as is served by ADVERTISER_ID. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AD_NETWORK_ID"
        },
        {
            "description": "The name of the network defined in AD_NETWORK_ID. Corresponds to \"Ad network name\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AD_NETWORK_NAME"
        },
        {
            "description": "Breaks down reporting data by salesperson User.id. Can be used to filter by User.id. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "SALESPERSON_ID"
        },
        {
            "description": "Breaks down reporting data by salesperson. User.name and User.id of the salesperson are automatically included as columns in the report. Can be used to filter by User.name. Corresponds to \"Salesperson\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "SALESPERSON_NAME"
        },
        {
            "description": "Breaks down reporting data by Creative.id or creative set id (master's Creative.id) if the creative is part of a creative set. Can be used to filter by Creative.id. Compatible with any of the following report types: Historical, Reach, Data protection.",
            "dimension": "CREATIVE_ID"
        },
        {
            "description": "Breaks down reporting data by creative. Creative.name and Creative.id are automatically included as columns in the report. Can be used to filter by Creative.name. Corresponds to \"Creative\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Data protection.",
            "dimension": "CREATIVE_NAME"
        },
        {
            "description": "Breaks down reporting data by creative type. Corresponds to \"Creative type\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CREATIVE_TYPE"
        },
        {
            "description": "Breaks down reporting data by creative billing type. Corresponds to \"Creative billing type\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CREATIVE_BILLING_TYPE"
        },
        {
            "description": "Breaks down reporting data by custom event ID. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CUSTOM_EVENT_ID"
        },
        {
            "description": "Breaks down reporting data by custom event name. Corresponds to \"Custom event\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CUSTOM_EVENT_NAME"
        },
        {
            "description": "Breaks down reporting data by custom event type (timer/exit/counter). Corresponds to \"Custom event type\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CUSTOM_EVENT_TYPE"
        },
        {
            "description": "Breaks down reporting data by Creative.size. Cannot be used for filtering. Corresponds to \"Creative size\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CREATIVE_SIZE"
        },
        {
            "description": "Breaks down reporting data by AdUnit.id. Can be used to filter by AdUnit.id. AD_UNIT_NAME, i.e. AdUnit.name, is automatically included as a dimension in the report. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales.",
            "dimension": "AD_UNIT_ID"
        },
        {
            "description": "Breaks down reporting data by ad unit. AdUnit.name and AdUnit.id are automatically included as columns in the report. Can be used to filter by AdUnit.name. Corresponds to \"Ad unit\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales.",
            "dimension": "AD_UNIT_NAME"
        },
        {
            "description": "Used to filter on all the descendants of an ad unit by AdUnit.id. Not available as a dimension to report on. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales.",
            "dimension": "PARENT_AD_UNIT_ID"
        },
        {
            "description": "Used to filter on all the descendants of an ad unit by AdUnit.name. Not available as a dimension to report on. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales.",
            "dimension": "PARENT_AD_UNIT_NAME"
        },
        {
            "description": "Breaks down reporting data by Placement.id. Can be used to filter by Placement.id. Compatible with any of the following report types: Historical, Future sell-through, Reach.",
            "dimension": "PLACEMENT_ID"
        },
        {
            "description": "Breaks down reporting data by placement. Placement.name and Placement.id are automatically included as columns in the report. Can be used to filter by Placement.name. Corresponds to \"Placement\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach.",
            "dimension": "PLACEMENT_NAME"
        },
        {
            "description": "Status of the placement. Not available as a dimension to report on, but exists as a dimension in order to filter on it using PQL. Can be used to filter on Placement.status by using InventoryStatus enumeration names. Compatible with any of the following report types: Historical, Future sell-through, Reach.",
            "dimension": "PLACEMENT_STATUS"
        },
        {
            "description": "Breaks down reporting data by criteria predefined by Ad Manager like the operating system, browser etc. Cannot be used for filtering. Corresponds to \"Targeting\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "TARGETING"
        },
        {
            "description": "The ID of the device category to which an ad is being targeted. Can be used to filter by device category ID. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "DEVICE_CATEGORY_ID"
        },
        {
            "description": "The category of device (smartphone, feature phone, tablet, or desktop) to which an ad is being targeted. Can be used to filter by device category name. Corresponds to \"Device category\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "DEVICE_CATEGORY_NAME"
        },
        {
            "description": "Breaks down reporting data by country criteria ID. Can be used to filter by country criteria ID. Compatible with any of the following report types: Historical, Future sell-through, Reach.",
            "dimension": "COUNTRY_CRITERIA_ID"
        },
        {
            "description": "Breaks down reporting data by country name. The country name and the country criteria ID are automatically included as columns in the report. Can be used to filter by country name using the US English name. Corresponds to \"Country\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach.",
            "dimension": "COUNTRY_NAME"
        },
        {
            "description": "Breaks down reporting data by region criteria ID. Can be used to filter by region criteria ID. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "REGION_CRITERIA_ID"
        },
        {
            "description": "Breaks down reporting data by region name. The region name and the region criteria ID are automatically included as columns in the report. Can be used to filter by region name using the US English name. Corresponds to \"Region\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "REGION_NAME"
        },
        {
            "description": "Breaks down reporting data by city criteria ID. Can be used to filter by city criteria ID. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CITY_CRITERIA_ID"
        },
        {
            "description": "Breaks down reporting data by city name. The city name and the city criteria ID are automatically included as columns in the report. Can be used to filter by city name using the US English name. Corresponds to \"City\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CITY_NAME"
        },
        {
            "description": "Breaks down reporting data by metro criteria ID. Can be used to filter by metro criteria ID. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "METRO_CRITERIA_ID"
        },
        {
            "description": "Breaks down reporting data by metro name. The metro name and the metro criteria ID are automatically included as columns in the report. Can be used to filter by metro name using the US English name. Corresponds to \"Metro\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "METRO_NAME"
        },
        {
            "description": "Breaks down reporting data by postal code criteria ID. Can be used to filter by postal code criteria ID. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "POSTAL_CODE_CRITERIA_ID"
        },
        {
            "description": "Breaks down reporting data by postal code. The postal code and the postal code criteria ID are automatically included as columns in the report. Can be used to filter by postal code. Corresponds to \"Postal code\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "POSTAL_CODE"
        },
        {
            "description": "Breaks down reporting data by CustomTargetingValue.id. Can be used to filter by CustomTargetingValue.id. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "CUSTOM_TARGETING_VALUE_ID"
        },
        {
            "description": "Breaks down reporting data by custom criteria. The CustomTargetingValue is displayed in the form: car=honda when value match type is CustomTargetingValue.MatchType.EXACT car~honda when value match type is CustomTargetingValue.MatchType.BROAD car=*honda when value match type is CustomTargetingValue.MatchType.PREFIX car~*honda when value match type is CustomTargetingValue.MatchType.BROAD_PREFIX CUSTOM_TARGETING_VALUE_ID, i.e. CustomTargetingValue.id is automatically included as a column in the report. Cannot be used for filtering; use CUSTOM_TARGETING_VALUE_ID instead. When using this Dimension, metrics for freeform key values are only reported on when they are registered with CustomTargetingService. Corresponds to \"Key-values\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "CUSTOM_CRITERIA"
        },
        {
            "description": "Breaks down reporting data by activity ID. Can be used to filter by activity ID. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "ACTIVITY_ID"
        },
        {
            "description": "Breaks down reporting data by activity. The activity name and the activity ID are automatically included as columns in the report. Can be used to filter by activity name. Corresponds to \"Activity\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "ACTIVITY_NAME"
        },
        {
            "description": "Breaks down reporting data by activity group ID. Can be used to filter by activity group ID. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "ACTIVITY_GROUP_ID"
        },
        {
            "description": "Breaks down reporting data by activity group. The activity group name and the activity group ID are automatically included as columns in the report. Can be used to filter by activity group name. Corresponds to \"Activity group\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "ACTIVITY_GROUP_NAME"
        },
        {
            "description": "Breaks down reporting data by Content.id. Can be used to filter by Content.id. Compatible with any of the following report types: Historical, Future sell-through, Reach.",
            "dimension": "CONTENT_ID"
        },
        {
            "description": "Breaks down reporting data by content. Content.name and Content.id are automatically included as columns in the report. Can be used to filter by Content.name. Corresponds to \"Content\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach.",
            "dimension": "CONTENT_NAME"
        },
        {
            "description": "Breaks down reporting data by ContentBundle.id. Can be used to filter by ContentBundle.id. Compatible with any of the following report types: Historical, Future sell-through, Reach.",
            "dimension": "CONTENT_BUNDLE_ID"
        },
        {
            "description": "Breaks down reporting data by content bundle. ContentBundle.name and ContentBundle.id are automatically included as columns in the report. Can be used to filter by ContentBundle.name. Corresponds to \"Content bundle\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach.",
            "dimension": "CONTENT_BUNDLE_NAME"
        },
        {
            "description": "Breaks down reporting data by CustomTargetingKey.id. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "VIDEO_METADATA_KEY_ID"
        },
        {
            "description": "Breaks down reporting data by custom targeting key. CustomTargetingKey.name and CustomTargetingKey.id are automatically included as columns in the report. Corresponds to \"Metadata key\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "VIDEO_METADATA_KEY_NAME"
        },
        {
            "description": "Breaks down reporting data by CMS metadata. To use this dimension in API, a list of cms metadata key IDs must be specified in ReportQuery.cmsMetadataKeyIds. This dimension can be used as a filter in the Statement in PQL syntax: CMS_METADATA_KEY[keyId]_ID = CMS metadata value ID For example: WHERE CMS_METADATA_KEY[4242]_ID = 53423",
            "dimension": "CMS_METADATA"
        },
        {
            "description": "Breaks down reporting data by the fallback position of the video ad, i.e., NON_FALLBACK, FALLBACK_POSITION_1, FALLBACK_POSITION_2, etc. Can be used for filtering. Corresponds to \"Fallback position\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "VIDEO_FALLBACK_POSITION"
        },
        {
            "description": "Breaks down reporting data by the position of the video ad within the video stream, i.e., UNKNOWN_POSITION, PREROLL, POSTROLL, UNKNOWN_MIDROLL, MIDROLL_1, MIDROLL_2, etc. UNKNOWN_MIDROLL represents a midroll, but which specific midroll is unknown. Can be used for filtering. Corresponds to \"Position of pod\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "POSITION_OF_POD"
        },
        {
            "description": "Breaks down reporting data by the position of the video ad within the pod, i.e., UNKNOWN_POSITION, POSITION_1, POSITION_2, etc. Can be used for filtering. Corresponds to \"Position in pod\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "POSITION_IN_POD"
        },
        {
            "description": "Breaks down reporting data by video redirect vendor. Corresponds to \"Video redirect third party\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "VIDEO_REDIRECT_THIRD_PARTY"
        },
        {
            "description": "The filter to break down reporting data by video break type. Not available as a dimension to report on. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "VIDEO_BREAK_TYPE"
        },
        {
            "description": "The filter to break down reporting data by video break type. Can only be used with the following string values: \"Unknown\", \"Single ad video request\", \"Optimized pod video request\". Not available as a dimension to report on. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "VIDEO_BREAK_TYPE_NAME"
        },
        {
            "description": "Breaks down reporting data by vast version type name. Corresponds to \"VAST version\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "VIDEO_VAST_VERSION"
        },
        {
            "description": "Breaks down reporting data by video request duration bucket. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "VIDEO_AD_REQUEST_DURATION_ID"
        },
        {
            "description": "Breaks down reporting data by video request duration bucket name. Corresponds to \"Video ad request duration\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "VIDEO_AD_REQUEST_DURATION"
        },
        {
            "description": "Breaks down reporting data by partner Company.id. Compatible with any of the following report types: Historical, Reach, Partner finance.",
            "dimension": "PARTNER_MANAGEMENT_PARTNER_ID"
        },
        {
            "description": "Breaks down reporting data by partner Company.name and Company.id are automatically included as columns in the report. Corresponds to \"Partner\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Partner finance.",
            "dimension": "PARTNER_MANAGEMENT_PARTNER_NAME"
        },
        {
            "description": "Breaks down reporting data by partner label Label.id. Compatible with any of the following report types: Historical, Reach, Partner finance.",
            "dimension": "PARTNER_MANAGEMENT_PARTNER_LABEL_ID"
        },
        {
            "description": "Breaks down reporting data by partner label. Label.name and Label.id are automatically included as columns in the report. Corresponds to \"Partner label\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Partner finance.",
            "dimension": "PARTNER_MANAGEMENT_PARTNER_LABEL_NAME"
        },
        {
            "description": "Breaks down reporting data by partner assignment id. Compatible with any of the following report types: Historical, Reach, Partner finance.",
            "dimension": "PARTNER_MANAGEMENT_ASSIGNMENT_ID"
        },
        {
            "description": "Breaks down reporting data by partner assignment name. ParnterAssignment name and id are automatically included as columns in the report. Corresponds to \"Assignment\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Partner finance.",
            "dimension": "PARTNER_MANAGEMENT_ASSIGNMENT_NAME"
        },
        {
            "description": "Breaks down reporting data by gender and age group, i.e., MALE_13_TO_17, MALE_18_TO_24, MALE_25_TO_34, MALE_35_TO_44, MALE_45_TO_54, MALE_55_TO_64, MALE_65_PLUS, FEMALE_13_TO_17, FEMALE_18_TO_24, FEMALE_25_TO_34, FEMALE_35_TO_44, FEMALE_45_TO_54, FEMALE_55_TO_64, FEMALE_65_PLUS, UNKNOWN_0_TO_17 and UNKNOWN. Whenever this dimension is selected, COUNTRY_NAME must be selected. This dimension is supported only for GRP columns. Can correspond to any of the following in the Ad Manager UI: Demographics, comScore vCE demographics. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "GRP_DEMOGRAPHICS"
        },
        {
            "description": "Breaks down reporting data by the ad unit sizes specified in ad requests. Formatted as comma separated values, e.g. \"300x250,300x250v,300x60\". This dimension is supported only for sell-through columns. Corresponds to \"Ad request sizes\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach.",
            "dimension": "AD_REQUEST_AD_UNIT_SIZES"
        },
        {
            "description": "Breaks down reporting data by the custom criteria specified in ad requests. Formatted as comma separated key-values, where a key-value is formatted as key1=value_1|...|value_n,key2=value_1|...|value_n,.... This dimension is supported only for sell-through columns. Corresponds to \"Key-values\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach.",
            "dimension": "AD_REQUEST_CUSTOM_CRITERIA"
        },
        {
            "description": "Whether the report contains only Ad Exchange traffic fulfilled by First Look Deals or omits it. If this filter isn't included, the report will include First Look Deals traffic in addition to any other traffic. This filter can only be used with the string values \"true\" and \"false\". Not available as a dimension to report on. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "IS_FIRST_LOOK_DEAL"
        },
        {
            "description": "Breaks down reporting data by yield group ID. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "YIELD_GROUP_ID"
        },
        {
            "description": "Breaks down reporting data by yield group name. Corresponds to \"Yield group\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "YIELD_GROUP_NAME"
        },
        {
            "description": "Breaks down reporting data by yield partner. Corresponds to \"Yield partner\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "YIELD_PARTNER"
        },
        {
            "description": "Breaks down reporting data by the tag of a yield partner in a yield group. Corresponds to \"Yield partner tag\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "YIELD_PARTNER_TAG"
        },
        {
            "description": "The ID of a classified advertiser. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CLASSIFIED_ADVERTISER_ID"
        },
        {
            "description": "The name of a classified advertiser. Corresponds to \"Advertiser (classified)\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CLASSIFIED_ADVERTISER_NAME"
        },
        {
            "description": "The ID of a classified brand. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CLASSIFIED_BRAND_ID"
        },
        {
            "description": "The name of a classified brand. Corresponds to \"Brand (classified)\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CLASSIFIED_BRAND_NAME"
        },
        {
            "description": "Breaks down reporting data by mediation type. A mediation type can be web, mobile app or video. Corresponds to \"Mediation type\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "MEDIATION_TYPE"
        },
        {
            "description": "Breaks down reporting data by native template (also known as creative template) ID. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "NATIVE_TEMPLATE_ID"
        },
        {
            "description": "Breaks down reporting data by native template (also known as creative template) name. Corresponds to \"Native ad format name\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "NATIVE_TEMPLATE_NAME"
        },
        {
            "description": "Breaks down reporting data by native style ID. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "NATIVE_STYLE_ID"
        },
        {
            "description": "Breaks down reporting data by native style name. Corresponds to \"Native style name\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "NATIVE_STYLE_NAME"
        },
        {
            "description": "Breaks down reporting data by child network ID in MCM \"Manage Inventory\". This experimental dimension only works for MCM \"Manage Inventory\" parent publishers. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CHILD_NETWORK_ID"
        },
        {
            "description": "Breaks down reporting data by child network code in MCM \"Manage Inventory\". This experimental dimension only works for MCM \"Manage Inventory\" parent publishers. Corresponds to \"Child network code\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CHILD_NETWORK_CODE"
        },
        {
            "description": "Breaks down reporting data by mobile app name. Can be used for filtering. Corresponds to \"App names\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "MOBILE_APP_NAME"
        },
        {
            "description": "Breaks down reporting data by device name. Can be used for filtering. Corresponds to \"Devices\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "MOBILE_DEVICE_NAME"
        },
        {
            "description": "Breaks down reporting data by inventory type. Can be used for filtering. Can correspond to any of the following in the Ad Manager UI: Inventory types (retired), Inventory types. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "MOBILE_INVENTORY_TYPE"
        },
        {
            "description": "Breaks down reporting data by request type. Can be used for filtering. Corresponds to \"Request type\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "REQUEST_TYPE"
        },
        {
            "description": "Status of the ad unit. Not available as a dimension to report on, but exists as a dimension in order to filter on it using PQL. Valid values correspond to InventoryStatus. Compatible with any of the following report types: Historical, Future sell-through, Reach.",
            "dimension": "AD_UNIT_STATUS"
        },
        {
            "description": "Breaks down reporting data by Creative.id. This includes regular creatives, and master and companions in case of creative sets. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "MASTER_COMPANION_CREATIVE_ID"
        },
        {
            "description": "Breaks down reporting data by creative. This includes regular creatives, and master and companions in case of creative sets. Corresponds to \"Master and Companion creative\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "MASTER_COMPANION_CREATIVE_NAME"
        },
        {
            "description": "Breaks down reporting data by billable audience segment ID. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AUDIENCE_SEGMENT_ID"
        },
        {
            "description": "Breaks down reporting data by billable audience segment name. Corresponds to \"Audience segment (billable)\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AUDIENCE_SEGMENT_NAME"
        },
        {
            "description": "Breaks down reporting data by audience segment data provider name. Corresponds to \"Data partner\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AUDIENCE_SEGMENT_DATA_PROVIDER_NAME"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange inventory size. Corresponds to \"Inventory sizes\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_INVENTORY_SIZE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange inventory size code. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AD_EXCHANGE_INVENTORY_SIZE_CODE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange device category. Corresponds to \"Device categories\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_DEVICE_CATEGORY"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange pricing rule ID. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AD_EXCHANGE_PRICING_RULE_ID"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange pricing rule. Corresponds to \"Pricing rules\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_PRICING_RULE_NAME"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange tag. Corresponds to \"Tags\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_TAG_NAME"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange URL. Corresponds to \"URLs\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_URL"
        },
        {
            "description": "Breaks down data by Ad Exchange mapped web property code. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AD_EXCHANGE_WEB_PROPERTY_CODE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange creative size. Corresponds to \"Creative sizes\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_CREATIVE_SIZES"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange ad type. Corresponds to \"Ad Types\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_AD_TYPE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange channel. Corresponds to \"Channels\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_CHANNEL_NAME"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange product. Corresponds to \"Products\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_PRODUCT_NAME"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange product code. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AD_EXCHANGE_PRODUCT_CODE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange site. Corresponds to \"Sites\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_SITE_NAME"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange request source. Corresponds to \"Request sources\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_REQUEST_SOURCES"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by the Ad Exchange advertiser name that bids on ads. Corresponds to \"Advertisers\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_ADVERTISER_NAME"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by the Ad Exchange brand name that bids on ads. Corresponds to \"Brands\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_BRAND_NAME"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange agency. Corresponds to \"Agencies\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_AGENCY"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange bid type code. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AD_EXCHANGE_BID_TYPE_CODE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange branding type code. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AD_EXCHANGE_BRANDING_TYPE_CODE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange branding type. Examples: Branded, Anonymous. Corresponds to \"Branding types\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_BRANDING_TYPE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange ad network name. Example: Google Adwords. Corresponds to \"Buyer networks\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_BUYER_NETWORK_NAME"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange ad network ID. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AD_EXCHANGE_BUYER_NETWORK_ID"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange custom channel code. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AD_EXCHANGE_CUSTOM_CHANNEL_CODE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange custom channel ID. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AD_EXCHANGE_CUSTOM_CHANNEL_ID"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange date, in Ad Exchange timezone. Note: In v201802 and later, this dimension is compatible with the following time zone types: TimeZoneType.AD_EXCHANGE Corresponds to \"Days\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_DATE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange deal id. Corresponds to \"Deal IDs\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_DEAL_ID"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange deal name. Corresponds to \"Deal names\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_DEAL_NAME"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange deal/transaction type. Example: Open auction. Corresponds to \"Transaction types\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_TRANSACTION_TYPE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange DSP buyer network name. Corresponds to \"DSPs\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_DSP_BUYER_NETWORK_NAME"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange expansion type. Corresponds to \"Expandable types\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_EXPANSION_TYPE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange country code. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AD_EXCHANGE_COUNTRY_CODE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange country name. Corresponds to \"Countries\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_COUNTRY_NAME"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Manager ad unit ID. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_DFP_AD_UNIT_ID"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Manager ad unit. Corresponds to \"DFP Ad Units\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_DFP_AD_UNIT"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange inventory ownership. Corresponds to \"Inventory ownership\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_INVENTORY_OWNERSHIP"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange advertiser domain. Corresponds to \"Advertiser domains\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_ADVERTISER_DOMAIN"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange mobile app name. Corresponds to \"App names\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_MOBILE_APP_NAME"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange mobile carrier name. Corresponds to \"Carrier names\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_MOBILE_CARRIER_NAME"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange mobile device name. Corresponds to \"Devices\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_MOBILE_DEVICE_NAME"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange mobile inventory type. Corresponds to \"Inventory types\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_MOBILE_INVENTORY_TYPE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange month, in Ad Exchange timezone. Note: In v201802 and later, this dimension is compatible with the following time zone types: TimeZoneType.AD_EXCHANGE Corresponds to \"Months\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_MONTH"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange network partner name. Corresponds to \"Network partner names\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_NETWORK_PARTNER_NAME"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange operating system version. Corresponds to \"Operating systems\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_OPERATING_SYSTEM"
        },
        {
            "description": "Breaks down reporting data by optimization type. Corresponds to \"Optimization type\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AD_EXCHANGE_OPTIMIZATION_TYPE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange tags. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AD_EXCHANGE_TAG_CODE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange targeting type code. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AD_EXCHANGE_TARGETING_TYPE_CODE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange targeting type. Corresponds to \"Targeting types\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_TARGETING_TYPE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange transaction type code Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AD_EXCHANGE_TRANSACTION_TYPE_CODE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange URL ID. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AD_EXCHANGE_URL_ID"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange user bandwidth. Corresponds to \"Bandwidth\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_USER_BANDWIDTH_NAME"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange video ad duration. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "AD_EXCHANGE_VIDEO_AD_DURATION"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange raw video ad duration. Corresponds to \"Video ad durations\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_VIDEO_AD_DURATION_RAW"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange video ad type. Corresponds to \"Video ad types\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_VIDEO_AD_TYPE"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange week, in Ad Exchange timezone. Note: In v201802 and later, this dimension is compatible with the following time zone types: TimeZoneType.AD_EXCHANGE Corresponds to \"Weeks\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_WEEK"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange ad location. Corresponds to \"Ad locations\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_AD_LOCATION"
        },
        {
            "description": "Breaks down mapped Ad Exchange web property data by Ad Exchange advertiser vertical. Corresponds to \"Advertiser verticals\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_ADVERTISER_VERTICAL"
        },
        {
            "description": "Campaign date segment of Nielsen Digital Ad Ratings reporting. Corresponds to \"Nielsen Digital Ad Ratings segment\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "NIELSEN_SEGMENT"
        },
        {
            "description": "Breaks down reporting data by gender and age group, i.e., MALE_18_TO_20, MALE_21_TO_24, MALE_25_TO_29, MALE_30_TO_35, MALE_35_TO_39, MALE_40_TO_44, MALE_45_TO_49, MALE_50_TO_54, MALE_55_TO_64, MALE_65_PLUS, FEMALE_18_TO_20, FEMALE_21_TO_24, FEMALE_25_TO_29, FEMALE_30_TO_34, FEMALE_35_TO_39, FEMALE_40_TO_44, FEMALE_45_TO_49, FEMALE_50_TO_54, FEMALE_55_TO_64, FEMALE_65_PLUS, and OTHER.",
            "dimension": "NIELSEN_DEMOGRAPHICS"
        },
        {
            "description": "Data restatement date of Nielsen Digital Ad Ratings data. Corresponds to \"Nielsen Digital Ad Ratings restatement date\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "NIELSEN_RESTATEMENT_DATE"
        },
        {
            "description": "Breaks down reporting data by ProposalMarketplaceInfo.buyerAccountId. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "PROGRAMMATIC_BUYER_ID"
        },
        {
            "description": "Breaks down reporting data by programmatic buyer name. Corresponds to \"Programmatic buyer\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "PROGRAMMATIC_BUYER_NAME"
        },
        {
            "description": "Breaks down reporting data by requested ad size(s). This can be a chain of sizes or a single size. Corresponds to \"Requested ad sizes\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "REQUESTED_AD_SIZES"
        },
        {
            "description": "Breaks down reporting data by the creative size the ad was delivered to. Corresponds to \"Creative size (delivered)\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CREATIVE_SIZE_DELIVERED"
        },
        {
            "description": "Breaks down reporting data by the type of transaction that occurred in Ad Exchange. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "PROGRAMMATIC_CHANNEL_ID"
        },
        {
            "description": "Breaks down reporting data by the type of transaction that occurred in Ad Exchange. Corresponds to \"Programmatic channel\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "PROGRAMMATIC_CHANNEL_NAME"
        },
        {
            "description": "Breaks down Demand reporting data by date in the network time zone. Can be used to filter by date using ISO 8601's format 'YYYY-MM-DD'\". Corresponds to \"Date\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_DATE"
        },
        {
            "description": "Breaks down Demand reporting data by week of the year in the network time zone. Cannot be used for filtering. Corresponds to \"Week\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_WEEK"
        },
        {
            "description": "Breaks down Demand reporting data by month and year in the network time zone. Cannot be used to filter. Corresponds to \"Month and year\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_MONTH_YEAR"
        },
        {
            "description": "Breaks down Demand reporting data by country criteria ID. Can be used to filter by country criteria ID. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_COUNTRY_CRITERIA_ID"
        },
        {
            "description": "Breaks down Demand reporting data by country name. The country name and the country criteria ID are automatically included as columns in the report. Can be used to filter by country name using the US English name. Corresponds to \"Country\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_COUNTRY_NAME"
        },
        {
            "description": "Breaks down Demand reporting data by inventory type. Corresponds to \"Inventory type\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_INVENTORY_TYPE"
        },
        {
            "description": "Breaks down Demand reporting data by the creative size the ad was delivered to. Corresponds to \"Creative size\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_CREATIVE_SIZE"
        },
        {
            "description": "Breaks down Demand reporting data by the brand name that bids on ads. Corresponds to \"Brand\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_BRAND_NAME"
        },
        {
            "description": "Breaks down Demand reporting data by the advertiser name that bid on ads. Corresponds to \"Advertiser\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_ADVERTISER_NAME"
        },
        {
            "description": "Breaks down Demand reporting data by Ad Exchange ad network name. Example: Google Adwords. Corresponds to \"Buyer network\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_ADX_BUYER_NETWORK_NAME"
        },
        {
            "description": "Breaks down reporting data by device name. Corresponds to \"Device\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_MOBILE_DEVICE_NAME"
        },
        {
            "description": "Breaks down reporting data by the category of device (smartphone, feature phone, tablet, or desktop). Corresponds to \"Device category\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_DEVICE_CATEGORY_NAME"
        },
        {
            "description": "Breaks down reporting data by the tag id provided by the publisher in the ad request. Corresponds to \"Tag ID\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_TAG_ID"
        },
        {
            "description": "Breaks down reporting data by the deal id provided by the publisher in the ad request. Corresponds to \"Deal IDs\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_DEAL_ID"
        },
        {
            "description": "Breaks down reporting data by mobile app ID. Corresponds to \"App ID\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_APP_ID"
        },
        {
            "description": "Breaks down reporting data by the CustomTargetingKeys marked as dimensions in inventory key-values setup. To use this dimension, a list of custom targeting key IDs must be specified in ReportQuery.customDimensionKeyIds.",
            "dimension": "CUSTOM_DIMENSION"
        },
        {
            "description": "Breaks down reporting data by demand channels. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "DEMAND_CHANNEL_ID"
        },
        {
            "description": "Breaks down reporting data by demand channel name. Corresponds to \"Demand channel\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "DEMAND_CHANNEL_NAME"
        }
    ],
    "dimension_attributes": [
        {
            "description": "Represents LineItem.effectiveAppliedLabels as a comma separated list of Label.name for Dimension.LINE_ITEM_NAME. Corresponds to \"Line item labels\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "LINE_ITEM_LABELS"
        },
        {
            "description": "Represents LineItem.effectiveAppliedLabels as a comma separated list of Label.id for Dimension.LINE_ITEM_NAME. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "LINE_ITEM_LABEL_IDS"
        },
        {
            "description": "Generated as true for Dimension.LINE_ITEM_NAME which is eligible for optimization, false otherwise. Can be used for filtering. Corresponds to \"Optimizable\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "LINE_ITEM_OPTIMIZABLE"
        },
        {
            "description": "Indicates the progress made for the delivery of the Dimension.LINE_ITEM_NAME. Progress Definition 100% The LineItem is on track to deliver in full as per LineItem.unitsBought. > 100% The LineItem is on track to overdeliver. < 100% The LineItem is on track to underdeliver. N/A The LineItem does not have any quantity goals, or there is insufficient information about the LineItem. Corresponds to \"Delivery Indicator\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "LINE_ITEM_DELIVERY_INDICATOR"
        },
        {
            "description": "Represents LineItem.deliveryRateType for Dimension.LINE_ITEM_NAME. Corresponds to \"Delivery pacing\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "LINE_ITEM_DELIVERY_PACING"
        },
        {
            "description": "Represents LineItem.frequencyCaps as a comma separated list of \"FrequencyCap.maxImpressions impressions per/every FrequencyCap.numTimeUnits FrequencyCap.timeUnit\" (e.g. \"10 impressions every day,500 impressions per lifetime\") for Dimension.LINE_ITEM_NAME. Corresponds to \"Frequency cap\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "LINE_ITEM_FREQUENCY_CAP"
        },
        {
            "description": "Represents the monthly reconciliation status of the line item for Dimension.LINE_ITEM_NAME and Dimension.MONTH_YEAR. Corresponds to \"Line item reconciliation status\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales.",
            "dimension": "LINE_ITEM_RECONCILIATION_STATUS"
        },
        {
            "description": "Represents the monthly last reconciliation date time of the line item for Dimension.LINE_ITEM_NAME and Dimension.MONTH_YEAR. Corresponds to \"Line item last reconciliation time\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales.",
            "dimension": "LINE_ITEM_LAST_RECONCILIATION_DATE_TIME"
        },
        {
            "description": "Represents Company.externalId for Dimension.ADVERTISER_NAME. Corresponds to \"External advertiser ID\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "ADVERTISER_EXTERNAL_ID"
        },
        {
            "description": "Represents Company.type for Dimension.ADVERTISER_NAME. Can be used for filtering. Corresponds to \"Advertiser type\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "ADVERTISER_TYPE"
        },
        {
            "description": "Represents Company.creditStatus for Dimension.ADVERTISER_NAME. Can be used for filtering. Corresponds to \"Advertiser credit status\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "ADVERTISER_CREDIT_STATUS"
        },
        {
            "description": "Represents name and email address in the form of name(email) of primary contact for Dimension.ADVERTISER_NAME. Corresponds to \"Advertiser primary contact\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "ADVERTISER_PRIMARY_CONTACT"
        },
        {
            "description": "Represents the start date (in YYYY-MM-DD format) for Dimension.ORDER_NAME. Can be used for filtering. Corresponds to \"Order start date\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "ORDER_START_DATE_TIME"
        },
        {
            "description": "Represents the end date (in YYYY-MM-DD format) for Dimension.ORDER_NAME. Can be used for filtering. Corresponds to \"Order end date\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "ORDER_END_DATE_TIME"
        },
        {
            "description": "Represents Order.externalOrderId for Dimension.ORDER_NAME. Corresponds to \"External order ID\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "ORDER_EXTERNAL_ID"
        },
        {
            "description": "Represents Order.poNumber for Dimension.ORDER_NAME. Can be used for filtering. Corresponds to \"Order PO number\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "ORDER_PO_NUMBER"
        },
        {
            "description": "Represents Order.orderIsProgrammatic for Dimension.ORDER_NAME. Can be used for filtering. Corresponds to \"Programmatic order\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "ORDER_IS_PROGRAMMATIC"
        },
        {
            "description": "Represents the name of Order.agencyId for Dimension.ORDER_NAME. Corresponds to \"Agency\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "ORDER_AGENCY"
        },
        {
            "description": "Represents Order.agencyId for Dimension.ORDER_NAME. Can be used for filtering. Corresponds to \"Agency ID\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "ORDER_AGENCY_ID"
        },
        {
            "description": "Represents Order.effectiveAppliedLabels as a comma separated list of Label.name for Dimension.ORDER_NAME. Corresponds to \"Order labels\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "ORDER_LABELS"
        },
        {
            "description": "Represents Order.effectiveAppliedLabels as a comma separated list of Label.id for Dimension.ORDER_NAME. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "ORDER_LABEL_IDS"
        },
        {
            "description": "The name and email address in the form of name(email) of the trafficker for Dimension.ORDER_NAME Corresponds to \"Trafficker\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "ORDER_TRAFFICKER"
        },
        {
            "description": "Represents Order.traffickerId for Dimension.ORDER_NAME. Can be used for filtering. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "ORDER_TRAFFICKER_ID"
        },
        {
            "description": "The names and email addresses as a comma separated list of name(email) of the Order.secondaryTraffickerIds for Dimension.ORDER_NAME. Corresponds to \"Secondary traffickers\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "ORDER_SECONDARY_TRAFFICKERS"
        },
        {
            "description": "The name and email address in the form of name(email) of the Order.salespersonId for Dimension.ORDER_NAME. Corresponds to \"Salesperson\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "ORDER_SALESPERSON"
        },
        {
            "description": "The names and email addresses as a comma separated list of name(email) of the Order.secondarySalespersonIds for Dimension.ORDER_NAME. Corresponds to \"Secondary salespeople\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "ORDER_SECONDARY_SALESPEOPLE"
        },
        {
            "description": "The total number of impressions delivered over the lifetime of an Dimension.ORDER_NAME. Corresponds to \"Order lifetime impressions\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "ORDER_LIFETIME_IMPRESSIONS"
        },
        {
            "description": "The total number of clicks delivered over the lifetime of an Dimension.ORDER_NAME. Corresponds to \"Order lifetime clicks\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "ORDER_LIFETIME_CLICKS"
        },
        {
            "description": "The cost of booking all the CPM ads for Dimension.ORDER_NAME. Corresponds to \"Booked CPM\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "ORDER_BOOKED_CPM"
        },
        {
            "description": "The cost of booking all the CPC ads for Dimension.ORDER_NAME. Corresponds to \"Booked CPC\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "ORDER_BOOKED_CPC"
        },
        {
            "description": "Represents the start date (in YYYY-MM-DD format) for Dimension.LINE_ITEM_NAME. Can be used for filtering. Corresponds to \"Line item start date\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "LINE_ITEM_START_DATE_TIME"
        },
        {
            "description": "Represents the end date (in YYYY-MM-DD format) for Dimension.LINE_ITEM_NAME. Can be used for filtering. Corresponds to \"Line item end date\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "LINE_ITEM_END_DATE_TIME"
        },
        {
            "description": "Represents LineItem.externalId for Dimension.LINE_ITEM_NAME. Can be used for filtering. Corresponds to \"External Line Item ID\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "LINE_ITEM_EXTERNAL_ID"
        },
        {
            "description": "Represents LineItem.costType for Dimension.LINE_ITEM_NAME. Can be used for filtering. Corresponds to \"Cost type\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "LINE_ITEM_COST_TYPE"
        },
        {
            "description": "Represents LineItem.costPerUnit for Dimension.LINE_ITEM_NAME. Corresponds to \"Rate\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "LINE_ITEM_COST_PER_UNIT"
        },
        {
            "description": "Represents the 3 letter currency code for Dimension.LINE_ITEM_NAME. Corresponds to \"Currency code\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "LINE_ITEM_CURRENCY_CODE"
        },
        {
            "description": "The total number of impressions, clicks or days that is reserved for Dimension.LINE_ITEM_NAME. Corresponds to \"Goal quantity\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "LINE_ITEM_GOAL_QUANTITY"
        },
        {
            "description": "The ratio between the goal quantity for Dimension.LINE_ITEM_NAME of LineItemType.SPONSORSHIP and the LINE_ITEM_GOAL_QUANTITY. Represented as a number between 0..100. Corresponds to \"Sponsorship goal (%)\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "LINE_ITEM_SPONSORSHIP_GOAL_PERCENTAGE"
        },
        {
            "description": "The total number of impressions delivered over the lifetime of a Dimension.LINE_ITEM_NAME. Corresponds to \"Line item lifetime impressions\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "LINE_ITEM_LIFETIME_IMPRESSIONS"
        },
        {
            "description": "The total number of clicks delivered over the lifetime of a Dimension.LINE_ITEM_NAME. Corresponds to \"Line item lifetime clicks\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "LINE_ITEM_LIFETIME_CLICKS"
        },
        {
            "description": "Represents LineItem.priority for Dimension.LINE_ITEM_NAME as a value between 1 and 16. Can be used for filtering. Corresponds to \"Line item priority\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales, Data protection.",
            "dimension": "LINE_ITEM_PRIORITY"
        },
        {
            "description": "Indicates if a creative is a regular creative or creative set. Values will be 'Creative' or 'Creative set' Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CREATIVE_OR_CREATIVE_SET"
        },
        {
            "description": "The type of creative in a creative set - master or companion. Corresponds to \"Master or Companion\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "MASTER_COMPANION_TYPE"
        },
        {
            "description": "Represents the LineItem.contractedUnitsBought quantity for Dimension.LINE_ITEM_NAME. Corresponds to \"Contracted quantity\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "LINE_ITEM_CONTRACTED_QUANTITY"
        },
        {
            "description": "Represents the LineItem.discount for Dimension.LINE_ITEM_NAME. The number is either a percentage or an absolute value depending on LineItem.discountType. Corresponds to \"Discount\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "LINE_ITEM_DISCOUNT"
        },
        {
            "description": "The cost of booking for a non-CPD Dimension.LINE_ITEM_NAME. Corresponds to \"Booked revenue (exclude CPD)\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "LINE_ITEM_NON_CPD_BOOKED_REVENUE"
        },
        {
            "description": "Represents Company.appliedLabels as a comma separated list of Label.name for Dimension.ADVERTISER_NAME. Corresponds to \"Advertiser labels\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "ADVERTISER_LABELS"
        },
        {
            "description": "Represents Company.appliedLabels as a comma separated list of Label.id for Dimension.ADVERTISER_NAME. Compatible with any of the following report types: Historical, Reach, Sales.",
            "dimension": "ADVERTISER_LABEL_IDS"
        },
        {
            "description": "Represents the click-through URL for Dimension.CREATIVE_NAME. Corresponds to \"Click-through URL\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CREATIVE_CLICK_THROUGH_URL"
        },
        {
            "description": "Represents whether a creative is SSL-compliant. Corresponds to \"Creative SSL scan result\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CREATIVE_SSL_SCAN_RESULT"
        },
        {
            "description": "Represents whether a creative's SSL status was overridden. Corresponds to \"Creative SSL compliance override\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CREATIVE_SSL_COMPLIANCE_OVERRIDE"
        },
        {
            "description": "Represents a LineItemCreativeAssociation.startDateTime for a Dimension.LINE_ITEM_NAME and a Dimension.CREATIVE_NAME. Includes the date without the time. Corresponds to \"Creative start date\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "LINE_ITEM_CREATIVE_START_DATE"
        },
        {
            "description": "Represents a LineItemCreativeAssociation.endDateTime for a Dimension.LINE_ITEM_NAME and a Dimension.CREATIVE_NAME. Includes the date without the time. Corresponds to \"Creative end date\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "LINE_ITEM_CREATIVE_END_DATE"
        },
        {
            "description": "Represents the CmsContent.displayName within the first element of Content.cmsContent for Dimension.CONTENT_NAME. Corresponds to \"Content source name\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CONTENT_CMS_NAME"
        },
        {
            "description": "Represents the CmsContent.cmsContentId within the first element of Content.cmsContent for Dimension.CONTENT_NAME. Corresponds to \"ID of the video in the content source\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Reach.",
            "dimension": "CONTENT_CMS_VIDEO_ID"
        },
        {
            "description": "Represents AdUnit.adUnitCode for Dimension.AD_UNIT_NAME. Corresponds to \"Ad unit code\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Future sell-through, Reach, Sales.",
            "dimension": "AD_UNIT_CODE"
        }
    ],
    "time_zone_types": [
        {
            "description": "The value returned if the actual value is not exposed by the requested API version.",
            "dimension": "UNKNOWN"
        },
        {
            "description": "Use the publisher's time zone. For Ad Manager reports, this time zone is compatible with all metrics. For Ad Exchange reports, this time zone is not compatible with \"Bids\" and \"Deals\" metrics. Note: if your report includes \"time unit\" dimensions, only the Ad Manager \"time unit\" dimensions are compatible with this timezone, e.g.: DATE WEEK MONTH_AND_YEAR",
            "dimension": "PUBLISHER"
        },
        {
            "description": "Use the Ad Exchange time zone (Pacific Time Zone). This time zone is only compatible with Ad Exchange metrics. Note: if your report includes \"time unit\" dimensions, only the Ad Exchange \"time unit\" dimensions are compatible with this timezone, e.g.: AD_EXCHANGE_DATE AD_EXCHANGE_WEEK AD_EXCHANGE_MONTH",
            "dimension": "AD_EXCHANGE"
        }
    ],
    "date_range_types": [
        {
            "description": "The current day.",
            "dimension": "TODAY"
        },
        {
            "description": "The previous day.",
            "dimension": "YESTERDAY"
        },
        {
            "description": "The last week, from monday to sunday.",
            "dimension": "LAST_WEEK"
        },
        {
            "description": "The previous month.",
            "dimension": "LAST_MONTH"
        },
        {
            "description": "The last 3 full months. For example, if today is May 5, 2017, then LAST_3_MONTHS would go from February 1 to April 30.",
            "dimension": "LAST_3_MONTHS"
        },
        {
            "description": "The last 63 days. This date range is only usable for the columns Column.REACH_FREQUENCY, Column.REACH_AVERAGE_REVENUE and Column.REACH.",
            "dimension": "REACH_LIFETIME"
        },
        {
            "description": "Specifying this value will enable the user to specify ReportQuery.startDate and ReportQuery.endDate.",
            "dimension": "CUSTOM_DATE"
        },
        {
            "description": "The next day.",
            "dimension": "NEXT_DAY"
        },
        {
            "description": "The next ninety days.",
            "dimension": "NEXT_90_DAYS"
        },
        {
            "description": "The next week, from monday to sunday.",
            "dimension": "NEXT_WEEK"
        },
        {
            "description": "The next month.",
            "dimension": "NEXT_MONTH"
        },
        {
            "description": "Beginning of the next day until the end of the next month.",
            "dimension": "CURRENT_AND_NEXT_MONTH"
        },
        {
            "description": "The next quarter.",
            "dimension": "NEXT_QUARTER"
        },
        {
            "description": "The next three months.",
            "dimension": "NEXT_3_MONTHS"
        },
        {
            "description": "The next twelve months.",
            "dimension": "NEXT_12_MONTHS"
        }
    ],
    "columns": [
        {
            "description": "The number of impressions delivered by the ad server. Corresponds to \"Ad server impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_IMPRESSIONS"
        },
        {
            "description": "The number of impressions delivered by the ad server by explicit custom criteria targeting. Corresponds to \"Ad server targeted impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_TARGETED_IMPRESSIONS"
        },
        {
            "description": "The number of clicks delivered by the ad server. Corresponds to \"Ad server clicks\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_CLICKS"
        },
        {
            "description": "The number of clicks delivered by the ad server by explicit custom criteria targeting. Corresponds to \"Ad server targeted clicks\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_TARGETED_CLICKS"
        },
        {
            "description": "The CTR for an ad delivered by the ad server. Corresponds to \"Ad server CTR\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_CTR"
        },
        {
            "description": "The CPM and CPC revenue earned, calculated in publisher currency, for the ads delivered by the ad server. Corresponds to \"Ad server CPM and CPC revenue\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_CPM_AND_CPC_REVENUE"
        },
        {
            "description": "The CPD revenue earned, calculated in publisher currency, for the ads delivered by the ad server. Corresponds to \"Ad server CPD revenue\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_CPD_REVENUE"
        },
        {
            "description": "The CPA revenue earned, calculated in publisher currency, for the ads delivered by the ad server. Corresponds to \"CPA revenue\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_CPA_REVENUE"
        },
        {
            "description": "The CPM, CPC and CPD revenue earned, calculated in publisher currency, for the ads delivered by the ad server. Can correspond to any of the following in the Ad Manager UI: Ad server CPM, CPC, CPD, and vCPM revenue, Ad server CPM, CPC and CPD revenue. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_ALL_REVENUE"
        },
        {
            "description": "The average estimated cost-per-thousand-impressions earned from the CPM and CPC ads delivered by the ad server. Corresponds to \"Ad server average eCPM\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_WITHOUT_CPD_AVERAGE_ECPM"
        },
        {
            "description": "The average estimated cost-per-thousand-impressions earned from the CPM, CPC and CPD ads delivered by the ad server.",
            "dimension": "AD_SERVER_WITH_CPD_AVERAGE_ECPM"
        },
        {
            "description": "The ratio of the number of impressions delivered to the total impressions delivered by the ad server for line item-level dynamic allocation. Represented as a percentage. Corresponds to \"Ad server impressions (%)\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_LINE_ITEM_LEVEL_PERCENT_IMPRESSIONS"
        },
        {
            "description": "The ratio of the number of clicks delivered to the total clicks delivered by the ad server for line item-level dynamic allocation. Represented as a percentage. Corresponds to \"Ad server clicks (%)\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_LINE_ITEM_LEVEL_PERCENT_CLICKS"
        },
        {
            "description": "The ratio of revenue generated by ad server to the total CPM, CPC and CPD revenue earned by ads delivered when no LineItem reservation could be found by the ad server for inventory-level dynamic allocation. For Ad Manager 360 networks, this includes line item-level dynamic allocation as well. Represented as a percentage.",
            "dimension": "AD_SERVER_INVENTORY_LEVEL_WITH_CPD_PERCENT_REVENUE"
        },
        {
            "description": "The ratio of revenue generated by ad server to the total CPM and CPC revenue earned by the ads delivered for line item-level dynamic allocation. Represented as a percentage. Corresponds to \"Ad server revenue (%)\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_LINE_ITEM_LEVEL_WITHOUT_CPD_PERCENT_REVENUE"
        },
        {
            "description": "The ratio of revenue generated by ad server to the total CPM, CPC and CPD revenue earned by the ads delivered for line item-level dynamic allocation. Represented as a percentage.",
            "dimension": "AD_SERVER_LINE_ITEM_LEVEL_WITH_CPD_PERCENT_REVENUE"
        },
        {
            "description": "The number of downloaded impressions delivered by the ad server including impressions recognized as spam. Corresponds to \"Ad server unfiltered downloaded impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_UNFILTERED_IMPRESSIONS"
        },
        {
            "description": "The number of clicks delivered by the ad server including clicks recognized as spam. Corresponds to \"Ad server unfiltered clicks\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_UNFILTERED_CLICKS"
        },
        {
            "description": "The number of impressions an AdSense ad delivered for line item-level dynamic allocation. Corresponds to \"AdSense impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "ADSENSE_LINE_ITEM_LEVEL_IMPRESSIONS"
        },
        {
            "description": "The number of impressions an AdSense ad delivered for line item-level dynamic allocation by explicit custom criteria targeting. Corresponds to \"AdSense targeted impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "ADSENSE_LINE_ITEM_LEVEL_TARGETED_IMPRESSIONS"
        },
        {
            "description": "The number of clicks an AdSense ad delivered for line item-level dynamic allocation. Corresponds to \"AdSense clicks\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "ADSENSE_LINE_ITEM_LEVEL_CLICKS"
        },
        {
            "description": "The number of clicks an AdSense ad delivered for line item-level dynamic allocation by explicit custom criteria targeting. Corresponds to \"AdSense targeted clicks\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "ADSENSE_LINE_ITEM_LEVEL_TARGETED_CLICKS"
        },
        {
            "description": "The ratio of clicks an AdSense reservation ad delivered to the number of impressions it delivered, including line item-level dynamic allocation. Corresponds to \"AdSense CTR\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "ADSENSE_LINE_ITEM_LEVEL_CTR"
        },
        {
            "description": "Revenue generated from AdSense ads delivered for line item-level dynamic allocation. Corresponds to \"AdSense revenue\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "ADSENSE_LINE_ITEM_LEVEL_REVENUE"
        },
        {
            "description": "The average estimated cost-per-thousand-impressions earned from the ads delivered by AdSense for line item-level dynamic allocation. Corresponds to \"AdSense average eCPM\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "ADSENSE_LINE_ITEM_LEVEL_AVERAGE_ECPM"
        },
        {
            "description": "The ratio of the number of impressions delivered by AdSense reservation ads to the total impressions delivered for line item-level dynamic allocation. Represented as a percentage. Corresponds to \"AdSense impressions (%)\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "ADSENSE_LINE_ITEM_LEVEL_PERCENT_IMPRESSIONS"
        },
        {
            "description": "The ratio of the number of clicks delivered by AdSense reservation ads to the total clicks delivered for line item-level dynamic allocation. Represented as a percentage. Corresponds to \"AdSense clicks (%)\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "ADSENSE_LINE_ITEM_LEVEL_PERCENT_CLICKS"
        },
        {
            "description": "The ratio of revenue to the total revenue earned from the dynamic allocation CPM, CPC and CPD ads delivered when no LineItem reservation could be found by the ad server for inventory-level dynamic allocation. For Ad Manager 360 networks, this includes line item-level dynamic allocation as well. Represented as a percentage.",
            "dimension": "DYNAMIC_ALLOCATION_INVENTORY_LEVEL_WITH_CPD_PERCENT_REVENUE"
        },
        {
            "description": "The ratio of revenue to the total revenue earned from the CPM and CPC ads delivered by AdSense for line item-level dynamic allocation. Represented as a percentage. Corresponds to \"AdSense revenue (%)\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "ADSENSE_LINE_ITEM_LEVEL_WITHOUT_CPD_PERCENT_REVENUE"
        },
        {
            "description": "The ratio of revenue to the total revenue earned from the CPM, CPC and CPD ads delivered by AdSense for line item-level dynamic allocation. Represented as a percentage.",
            "dimension": "ADSENSE_LINE_ITEM_LEVEL_WITH_CPD_PERCENT_REVENUE"
        },
        {
            "description": "The number of impressions an Ad Exchange ad delivered for line item-level dynamic allocation. Corresponds to \"Ad Exchange impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_EXCHANGE_LINE_ITEM_LEVEL_IMPRESSIONS"
        },
        {
            "description": "Ad Impressions on mapped Ad Exchange properties. When multiple text ads fill a single display slot it is only counted once, when the top text ad is recognized. In these cases, the Ad Impression is attributed to the top text ad. Corresponds to \"Ad impressions\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_IMPRESSIONS"
        },
        {
            "description": "Number of requests where a buyer was matched with the Ad request, for mapped Ad Exchange properties. Corresponds to \"Matched requests\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_MATCHED_REQUESTS"
        },
        {
            "description": "Ad revenue per 1000 ad impressions, for mapped Ad Exchange properties. Corresponds to \"Ad eCPM\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_AD_ECPM"
        },
        {
            "description": "The number of clicks delivered by mapped Ad Exchange properties. Corresponds to \"Clicks\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_CLICKS"
        },
        {
            "description": "The estimated net revenue generated by mapped Ad Exchange properties. Corresponds to \"Estimated revenue\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_ESTIMATED_REVENUE"
        },
        {
            "description": "The coverage reported by mapped Ad Exchange properties. Corresponds to \"Coverage\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_COVERAGE"
        },
        {
            "description": "The matched queries click-through rate delivered by mapped Ad Exchange properties. Corresponds to \"CTR\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_CTR"
        },
        {
            "description": "The total lift generated by mapped Ad Exchange properties. Corresponds to \"Lift\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_LIFT"
        },
        {
            "description": "The cost-per-click generated by mapped Ad Exchange properties. Corresponds to \"CPC\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_CPC"
        },
        {
            "description": "The number of ad requests issued by mapped Ad Exchange properties. Corresponds to \"Ad requests\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_AD_REQUESTS"
        },
        {
            "description": "The average estimated cost-per-thousand-ad requests earned by mapped Ad Exchange properties. Corresponds to \"Ad request eCPM\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_AD_REQUEST_ECPM"
        },
        {
            "description": "The click-through rate of ad requests issued by mapped Ad Exchange properties. Corresponds to \"Ad request CTR\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_AD_REQUEST_CTR"
        },
        {
            "description": "The click-through rate of impressions issued by mapped Ad Exchange properties. Corresponds to \"Ad CTR\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_AD_CTR"
        },
        {
            "description": "The video drop off rate for mapped Ad Exchange properties. Corresponds to \"Video drop-off rate\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_VIDEO_DROPOFF_RATE"
        },
        {
            "description": "The video abandonment rate for mapped Ad Exchange properties. Corresponds to \"Video abandonment rate\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_VIDEO_ABANDONMENT_RATE"
        },
        {
            "description": "The average estimated cost-per-thousand-impressions generated by mapped Ad Exchange properties. Corresponds to \"Matched eCPM\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_MATCHED_ECPM"
        },
        {
            "description": "The estimated percentage of impressions generated by mapped Ad Exchange properties that are eligible for Active View measurement. Corresponds to \"Active view measurable\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_ACTIVE_VIEW_MEASURABLE"
        },
        {
            "description": "The percentage of viewable impressions out of all measurable impressions generated by mapped Ad Exchange properties. Corresponds to \"Active view viewable\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_ACTIVE_VIEW_VIEWABLE"
        },
        {
            "description": "The average time (in seconds) that an individual ad impression generated by mapped Ad Exchange properties was viewable. Corresponds to \"Average viewable time (secs)\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_AVERAGE_VIEWABLE_TIME"
        },
        {
            "description": "Total number of impressions generated by mapped Ad Exchange properties that were eligible to measure viewability. Corresponds to \"Active view enabled impressions\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_ACTIVE_VIEW_ENABLED_IMPRESSIONS"
        },
        {
            "description": "Total number of eligible impressions generated by mapped Ad Exchange properties that were measurable by Active View. Corresponds to \"Active view measured impressions\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_ACTIVE_VIEW_MEASURED_IMPRESSIONS"
        },
        {
            "description": "Total number of Active View measurable impressions generated by mapped Ad Exchange properties that were viewable. Corresponds to \"Active view viewed impressions\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_ACTIVE_VIEW_VIEWED_IMPRESSIONS"
        },
        {
            "description": "Number of responses that shows that a buyer is bidding, for mapped Ad Exchange properties. Corresponds to \"Deals bid responses\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_DEALS_BID_RESPONSES"
        },
        {
            "description": "Deal ad requests for mapped Ad Exchange properties which were ?matched? with demand from the buyer associated with the Deal. Each ?Deals matched request? represents one opportunity for the Deal Buyer to serve their ad in the context of the Deal. Corresponds to \"Deals matched requests\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_DEALS_MATCHED_REQUESTS"
        },
        {
            "description": "Total ad requests associated with a given Deal, for mapped Ad Exchange properties. Corresponds to \"Deals ad requests\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_DEALS_AD_REQUESTS"
        },
        {
            "description": "Deals matched requests divided by Deals ad requests, for mapped Ad Exchange properties. Corresponds to \"Deals match rate\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_DEALS_MATCH_RATE"
        },
        {
            "description": "A count of how many users watch the first 25% of a video ad, for mapped Ad Exchange properties.",
            "dimension": "AD_EXCHANGE_VIDEO_QUARTILE_1"
        },
        {
            "description": "A count of how many users watch the first 75% of a video ad, for mapped Ad Exchange properties.",
            "dimension": "AD_EXCHANGE_VIDEO_QUARTILE_3"
        },
        {
            "description": "Percentage of times a user clicked Skip, for mapped Ad Exchange properties. Corresponds to \"TrueView skip rate\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_VIDEO_TRUEVIEW_SKIP_RATE"
        },
        {
            "description": "Number of times a video ad has been viewed to completion or watched to 30 seconds, whichever happens first, for mapped Ad Exchange properties. Corresponds to \"TrueView views\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_VIDEO_TRUEVIEW_VIEWS"
        },
        {
            "description": "TrueView views divided by TrueView impressions, for mapped Ad Exchange properties. Corresponds to \"TrueView VTR\" in the Ad Manager UI. Compatible with the \"Ad Exchange historical\" report type.",
            "dimension": "AD_EXCHANGE_VIDEO_TRUEVIEW_VTR"
        },
        {
            "description": "Mediation third-party average cost-per-thousand-impressions. Compatible with the \"Historical\" report type.",
            "dimension": "MEDIATION_THIRD_PARTY_ECPM"
        },
        {
            "description": "The number of impressions an Ad Exchange ad delivered for line item-level dynamic allocation by explicit custom criteria targeting. Corresponds to \"Ad Exchange targeted impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_EXCHANGE_LINE_ITEM_LEVEL_TARGETED_IMPRESSIONS"
        },
        {
            "description": "The number of clicks an Ad Exchange ad delivered for line item-level dynamic allocation. Corresponds to \"Ad Exchange clicks\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_EXCHANGE_LINE_ITEM_LEVEL_CLICKS"
        },
        {
            "description": "The number of clicks an Ad Exchange ad delivered for line item-level dynamic allocation by explicit custom criteria targeting. Corresponds to \"Ad Exchange targeted clicks\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_EXCHANGE_LINE_ITEM_LEVEL_TARGETED_CLICKS"
        },
        {
            "description": "The ratio of clicks an Ad Exchange ad delivered to the number of impressions it delivered for line item-level dynamic allocation. Corresponds to \"Ad Exchange CTR\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_EXCHANGE_LINE_ITEM_LEVEL_CTR"
        },
        {
            "description": "The ratio of the number of impressions delivered to the total impressions delivered by Ad Exchange for line item-level dynamic allocation. Represented as a percentage. Corresponds to \"Ad Exchange impressions (%)\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_EXCHANGE_LINE_ITEM_LEVEL_PERCENT_IMPRESSIONS"
        },
        {
            "description": "The ratio of the number of clicks delivered to the total clicks delivered by Ad Exchange for line item-level dynamic allocation. Represented as a percentage. Corresponds to \"Ad Exchange clicks (%)\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_EXCHANGE_LINE_ITEM_LEVEL_PERCENT_CLICKS"
        },
        {
            "description": "Revenue generated from Ad Exchange ads delivered for line item-level dynamic allocation. Represented in publisher currency and time zone. Corresponds to \"Ad Exchange revenue\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_EXCHANGE_LINE_ITEM_LEVEL_REVENUE"
        },
        {
            "description": "The ratio of revenue generated by Ad Exchange to the total revenue earned by CPM and CPC ads delivered for line item-level dynamic allocation. Represented as a percentage. Corresponds to \"Ad Exchange revenue (%)\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_EXCHANGE_LINE_ITEM_LEVEL_WITHOUT_CPD_PERCENT_REVENUE"
        },
        {
            "description": "The ratio of revenue generated by Ad Exchange to the total revenue earned by CPM, CPC and CPD ads delivered for line item-level dynamic allocation. Represented as a percentage.",
            "dimension": "AD_EXCHANGE_LINE_ITEM_LEVEL_WITH_CPD_PERCENT_REVENUE"
        },
        {
            "description": "The average estimated cost-per-thousand-impressions earned from the delivery of Ad Exchange ads for line item-level dynamic allocation. Corresponds to \"Ad Exchange average eCPM\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_EXCHANGE_LINE_ITEM_LEVEL_AVERAGE_ECPM"
        },
        {
            "description": "The total number of impressions delivered including line item-level dynamic allocation. Corresponds to \"Total impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_LINE_ITEM_LEVEL_IMPRESSIONS"
        },
        {
            "description": "The total number of impressions delivered including line item-level dynamic allocation by explicit custom criteria targeting. Corresponds to \"Total targeted impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_LINE_ITEM_LEVEL_TARGETED_IMPRESSIONS"
        },
        {
            "description": "The total number of clicks delivered including line item-level dynamic allocation. Corresponds to \"Total clicks\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_LINE_ITEM_LEVEL_CLICKS"
        },
        {
            "description": "The total number of clicks delivered including line item-level dynamic allocation by explicit custom criteria targeting Corresponds to \"Total targeted clicks\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_LINE_ITEM_LEVEL_TARGETED_CLICKS"
        },
        {
            "description": "The ratio of total clicks on ads delivered by the ad servers to the total number of impressions delivered for an ad including line item-level dynamic allocation. Corresponds to \"Total CTR\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_LINE_ITEM_LEVEL_CTR"
        },
        {
            "description": "The total CPM, CPC and CPD revenue generated by the ad servers including inventory-level dynamic allocation.",
            "dimension": "TOTAL_INVENTORY_LEVEL_ALL_REVENUE"
        },
        {
            "description": "The total CPM and CPC revenue generated by the ad servers including line item-level dynamic allocation. Corresponds to \"Total CPM and CPC revenue\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_LINE_ITEM_LEVEL_CPM_AND_CPC_REVENUE"
        },
        {
            "description": "The total CPM, CPC and CPD revenue generated by the ad servers including line item-level dynamic allocation. Can correspond to any of the following in the Ad Manager UI: Total CPM, CPC, CPD, and vCPM revenue, Total CPM, CPC and CPD revenue. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_LINE_ITEM_LEVEL_ALL_REVENUE"
        },
        {
            "description": "Estimated cost-per-thousand-impressions (eCPM) of CPM, CPC and CPD ads delivered by the ad servers including inventory-level dynamic allocation.",
            "dimension": "TOTAL_INVENTORY_LEVEL_WITH_CPD_AVERAGE_ECPM"
        },
        {
            "description": "Estimated cost-per-thousand-impressions (eCPM) of CPM and CPC ads delivered by the ad servers including line item-level dynamic allocation. Corresponds to \"Total average eCPM\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_LINE_ITEM_LEVEL_WITHOUT_CPD_AVERAGE_ECPM"
        },
        {
            "description": "Estimated cost-per-thousand-impressions (eCPM) of CPM, CPC and CPD ads delivered by the ad servers including line item-level dynamic allocation.",
            "dimension": "TOTAL_LINE_ITEM_LEVEL_WITH_CPD_AVERAGE_ECPM"
        },
        {
            "description": "The total number of times that the code for an ad is served by the ad server including inventory-level dynamic allocation. Corresponds to \"Total code served count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_CODE_SERVED_COUNT"
        },
        {
            "description": "The total number of times that an ad request is sent to the ad server including dynamic allocation. Corresponds to \"Total ad requests\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_AD_REQUESTS"
        },
        {
            "description": "The total number of times that an ad is served by the ad server including dynamic allocation. Corresponds to \"Total responses served\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_RESPONSES_SERVED"
        },
        {
            "description": "The total number of times that an ad is not returned by the ad server. Corresponds to \"Total unmatched ad requests\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_UNMATCHED_AD_REQUESTS"
        },
        {
            "description": "The fill rate indicating how often an ad request is filled by the ad server including dynamic allocation. Corresponds to \"Total fill rate\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_FILL_RATE"
        },
        {
            "description": "The total number of times that an ad is served by the ad server. Corresponds to \"Ad server responses served\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_RESPONSES_SERVED"
        },
        {
            "description": "The total number of times that an AdSense ad is delivered. Corresponds to \"AdSense responses served\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "ADSENSE_RESPONSES_SERVED"
        },
        {
            "description": "The total number of times that an Ad Exchange ad is delivered. Corresponds to \"Ad Exchange responses served\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_EXCHANGE_RESPONSES_SERVED"
        },
        {
            "description": "The total number of missed impressions due to the ad servers' inability to find ads to serve, including inventory-level dynamic allocation. Corresponds to \"Unfilled impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_INVENTORY_LEVEL_UNFILLED_IMPRESSIONS"
        },
        {
            "description": "The number of control (unoptimized) impressions delivered for an ad for which the optimization feature has been enabled. Corresponds to \"Control impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_CONTROL_IMPRESSIONS"
        },
        {
            "description": "Number of clicks resulting from the delivery of control (unoptimized) impressions for an ad for which the optimization feature has been enabled. Corresponds to \"Control clicks\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_CONTROL_CLICKS"
        },
        {
            "description": "The CTR for control (unoptimized) impressions for an order for which the optimization feature has been enabled. Corresponds to \"Control CTR\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_CONTROL_CTR"
        },
        {
            "description": "Number of optimized impressions delivered for an ad for which the optimization feature has been enabled. Corresponds to \"Optimized impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_OPTIMIZED_IMPRESSIONS"
        },
        {
            "description": "Number of clicks resulting from the delivery of optimized impressions for an ad for which the optimization feature has been enabled. Corresponds to \"Optimized clicks\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_OPTIMIZED_CLICKS"
        },
        {
            "description": "Number of non-optimized impressions delivered for an ad for which the optimization feature has been enabled. Corresponds to \"Non-optimized impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_NON_OPTIMIZED_IMPRESSIONS"
        },
        {
            "description": "Number of clicks resulting from the delivery of non-optimized impressions for an ad for which the optimization feature has been enabled. Corresponds to \"Non-optimized clicks\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_NON_OPTIMIZED_CLICKS"
        },
        {
            "description": "Number of extra clicks resulting from the delivery of optimized impressions for an ad for which the optimization feature has been enabled. Corresponds to \"Extra clicks\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_EXTRA_CLICKS"
        },
        {
            "description": "The CTR for optimized impressions for an ad for which the optimization feature has been enabled. Corresponds to \"Optimized CTR\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_OPTIMIZED_CTR"
        },
        {
            "description": "The percentage by which optimized CTRs are greater than the unoptimized CTRs. This is calculated as ((Column.OPTIMIZATION_OPTIMIZED_CTR/ Column.OPTIMIZATION_CONTROL_CTR) - 1) * 100 for an ad for which the optimization feature has been enabled. Corresponds to \"Lift\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_LIFT"
        },
        {
            "description": "The line item coverage measures how often the traffic was sent for optimization. Corresponds to \"Percent optimized\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_COVERAGE"
        },
        {
            "description": "The number of impressions that were behind schedule at the time of their delivery. Corresponds to \"Impressions that are behind schedule\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_BEHIND_SCHEDULE_IMPRESSIONS"
        },
        {
            "description": "The number of impressions that did not have any clicks recorded in the recent past. Corresponds to \"Impressions with no clicks recorded\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_NO_CLICKS_RECORDED_IMPRESSIONS"
        },
        {
            "description": "The number of impressions that were delivered as sponsorship items. Corresponds to \"Sponsorship impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_SPONSORSHIP_IMPRESSIONS"
        },
        {
            "description": "The number of impressions that were set to deliver as fast as possible. Corresponds to \"Impressions serving as fast as possible\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_AS_FAST_AS_POSSIBLE_IMPRESSIONS"
        },
        {
            "description": "The number of impressions that have no absolute lifetime delivery goals. Corresponds to \"Impressions with no lifetime goal\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_NO_ABSOLUTE_LIFETIME_GOAL_IMPRESSIONS"
        },
        {
            "description": "Total revenue resulting from the delivery of control (unoptimized) impressions for an ad for which the optimization feature has been enabled. Corresponds to \"Control revenue\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_CONTROL_REVENUE"
        },
        {
            "description": "Total revenue resulting from the delivery of optimized impressions for an ad for which the optimization feature has been enabled. Corresponds to \"Optimized revenue\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_OPTIMIZED_REVENUE"
        },
        {
            "description": "Estimated cost-per-thousand-impressions (eCPM) of control (unoptimized) impressions for an ad for which the optimization feature has been enabled. Corresponds to \"Control eCPM\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_CONTROL_ECPM"
        },
        {
            "description": "Estimated cost-per-thousand-impressions (eCPM) of optimized impressions for an ad for which the optimization feature has been enabled. Corresponds to \"Optimized eCPM\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_OPTIMIZED_ECPM"
        },
        {
            "description": "Freed-up impressions as a result of optimization. Corresponds to \"Freed-up impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_FREED_UP_IMPRESSIONS"
        },
        {
            "description": "Relative change in eCPM as a result of optimization. Corresponds to \"eCPM lift\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "OPTIMIZATION_ECPM_LIFT"
        },
        {
            "description": "Corresponds to \"Average impressions/unique visitor\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "UNIQUE_REACH_FREQUENCY"
        },
        {
            "description": "Corresponds to \"Total reach impressions\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "UNIQUE_REACH_IMPRESSIONS"
        },
        {
            "description": "Corresponds to \"Total unique visitors\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "UNIQUE_REACH"
        },
        {
            "description": "The number of people in the given demographic bucket. Corresponds to \"Population\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "GRP_POPULATION"
        },
        {
            "description": "The number of unique users reached in the given demographic bucket. Corresponds to \"Unique viewers\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "GRP_UNIQUE_AUDIENCE"
        },
        {
            "description": "Percentage of the number of unique users reached in the given demographic bucket (out of the number of unique users reached in all demographics). Corresponds to \"% Composition unique viewers\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "GRP_UNIQUE_AUDIENCE_SHARE"
        },
        {
            "description": "The number of impressions in the given demographic bucket. Corresponds to \"Impressions\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "GRP_AUDIENCE_IMPRESSIONS"
        },
        {
            "description": "Percentage of the number of impressions in the given demographic bucket (out of the number of impressions in all demographics). Corresponds to \"% Composition impressions\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "GRP_AUDIENCE_IMPRESSIONS_SHARE"
        },
        {
            "description": "The audience reach calculated as GRP_UNIQUE_AUDIENCE / GRP_POPULATION. Corresponds to \"% Population reach\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "GRP_AUDIENCE_REACH"
        },
        {
            "description": "The audience average frequency calculated as GRP_AUDIENCE_IMPRESSIONS / GRP_UNIQUE_AUDIENCE. Corresponds to \"Average frequency\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "GRP_AUDIENCE_AVERAGE_FREQUENCY"
        },
        {
            "description": "The gross rating points (GRP) calculated as GRP_AUDIENCE_REACH * GRP_AUDIENCE_AVERAGE_FREQUENCY * 100. Corresponds to \"Target rating points\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "GRP_GROSS_RATING_POINTS"
        },
        {
            "description": "The number of impressions for a particular SDK mediation creative. Corresponds to \"SDK mediation creative impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "SDK_MEDIATION_CREATIVE_IMPRESSIONS"
        },
        {
            "description": "The number of clicks for a particular SDK mediation creative. Corresponds to \"SDK mediation creative clicks\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "SDK_MEDIATION_CREATIVE_CLICKS"
        },
        {
            "description": "The number of forecasted impressions for future sell-through reports. This metric is available for the next 90 days with a daily break down and for the next 12 months with a monthly break down. Corresponds to \"Forecasted impressions\" in the Ad Manager UI. Compatible with the \"Future sell-through\" report type.",
            "dimension": "SELL_THROUGH_FORECASTED_IMPRESSIONS"
        },
        {
            "description": "The number of available impressions for future sell-through reports. This metric is available for the next 90 days with a daily break down and for the next 12 months with a monthly break down. Corresponds to \"Available impressions\" in the Ad Manager UI. Compatible with the \"Future sell-through\" report type.",
            "dimension": "SELL_THROUGH_AVAILABLE_IMPRESSIONS"
        },
        {
            "description": "The number of reserved impressions for future sell-through reports. This metric is available for the next 90 days with a daily break down and for the next 12 months with a monthly break down. Corresponds to \"Reserved impressions\" in the Ad Manager UI. Compatible with the \"Future sell-through\" report type.",
            "dimension": "SELL_THROUGH_RESERVED_IMPRESSIONS"
        },
        {
            "description": "The sell-through rate for impressions for future sell-through reports. This metric is available for the next 90 days with a daily break down and for the next 12 months with a monthly break down. Corresponds to \"Sell-through rate\" in the Ad Manager UI. Compatible with the \"Future sell-through\" report type.",
            "dimension": "SELL_THROUGH_SELL_THROUGH_RATE"
        },
        {
            "description": "The total number of times a backup image is served in place of a rich media ad. Corresponds to \"Backup image impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_BACKUP_IMAGES"
        },
        {
            "description": "The amount of time(seconds) that each rich media ad is displayed to users. Corresponds to \"Total display time\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_DISPLAY_TIME"
        },
        {
            "description": "The average amount of time(seconds) that each rich media ad is displayed to users. Corresponds to \"Average display time\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_AVERAGE_DISPLAY_TIME"
        },
        {
            "description": "The number of times an expanding ad was expanded. Corresponds to \"Total expansions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_EXPANSIONS"
        },
        {
            "description": "The average amount of time(seconds) that an expanding ad is viewed in an expanded state. Corresponds to \"Average expanding time\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_EXPANDING_TIME"
        },
        {
            "description": "The average amount of time(seconds) that a user interacts with a rich media ad. Corresponds to \"Interaction time\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_INTERACTION_TIME"
        },
        {
            "description": "The number of times that a user interacts with a rich media ad. Corresponds to \"Total interactions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_INTERACTION_COUNT"
        },
        {
            "description": "The ratio of rich media ad interactions to the number of times the ad was displayed. Represented as a percentage. Corresponds to \"Interaction rate\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_INTERACTION_RATE"
        },
        {
            "description": "The average amount of time(seconds) that a user interacts with a rich media ad. Corresponds to \"Average interaction time\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_AVERAGE_INTERACTION_TIME"
        },
        {
            "description": "The number of impressions where a user interacted with a rich media ad. Corresponds to \"Interactive impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_INTERACTION_IMPRESSIONS"
        },
        {
            "description": "The number of times that a user manually closes a floating, expanding, in-page with overlay, or in-page with floating ad. Corresponds to \"Manual closes\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_MANUAL_CLOSES"
        },
        {
            "description": "A metric that measures an impression only once when a user opens an ad in full screen mode. Corresponds to \"Full-screen impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_FULL_SCREEN_IMPRESSIONS"
        },
        {
            "description": "The number of times a user clicked on the graphical controls of a video player. Corresponds to \"Total video interactions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_VIDEO_INTERACTIONS"
        },
        {
            "description": "The ratio of video interactions to video plays. Represented as a percentage. Corresponds to \"Video interaction rate\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_VIDEO_INTERACTION_RATE"
        },
        {
            "description": "The number of times a rich media video was muted. Corresponds to \"Mute\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_VIDEO_MUTES"
        },
        {
            "description": "The number of times a rich media video was paused. Corresponds to \"Pause\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_VIDEO_PAUSES"
        },
        {
            "description": "The number of times a rich media video was played. Corresponds to \"Plays\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_VIDEO_PLAYES"
        },
        {
            "description": "The number of times a rich media video was played upto midpoint. Corresponds to \"Midpoint\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_VIDEO_MIDPOINTS"
        },
        {
            "description": "The number of times a rich media video was fully played. Corresponds to \"Complete\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_VIDEO_COMPLETES"
        },
        {
            "description": "The number of times a rich media video was restarted. Corresponds to \"Replays\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_VIDEO_REPLAYS"
        },
        {
            "description": "The number of times a rich media video was stopped. Corresponds to \"Stops\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_VIDEO_STOPS"
        },
        {
            "description": "The number of times a rich media video was unmuted. Corresponds to \"Unmute\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_VIDEO_UNMUTES"
        },
        {
            "description": "The average amount of time(seconds) that a rich media video was viewed per view. Corresponds to \"Average view time\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_VIDEO_VIEW_TIME"
        },
        {
            "description": "The percentage of a video watched by a user. Corresponds to \"View rate\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_VIDEO_VIEW_RATE"
        },
        {
            "description": "The amount of time (seconds) that a user interacts with a rich media ad. Corresponds to \"Custom event - time\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_CUSTOM_EVENT_TIME"
        },
        {
            "description": "The number of times a user views and interacts with a specified part of a rich media ad. Corresponds to \"Custom event - count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "RICH_MEDIA_CUSTOM_EVENT_COUNT"
        },
        {
            "description": "The number of impressions where the video was played. Corresponds to \"Start\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_VIEWERSHIP_START"
        },
        {
            "description": "The number of times the video played to 25% of its length. Corresponds to \"First quartile\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_VIEWERSHIP_FIRST_QUARTILE"
        },
        {
            "description": "The number of times the video reached its midpoint during play. Corresponds to \"Midpoint\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_VIEWERSHIP_MIDPOINT"
        },
        {
            "description": "The number of times the video played to 75% of its length. Corresponds to \"Third quartile\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_VIEWERSHIP_THIRD_QUARTILE"
        },
        {
            "description": "The number of times the video played to completion. Corresponds to \"Complete\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_VIEWERSHIP_COMPLETE"
        },
        {
            "description": "Average percentage of the video watched by users. Corresponds to \"Average view rate\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_VIEWERSHIP_AVERAGE_VIEW_RATE"
        },
        {
            "description": "Average time(seconds) users watched the video. Corresponds to \"Average view time\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_VIEWERSHIP_AVERAGE_VIEW_TIME"
        },
        {
            "description": "Percentage of times the video played to the end. Corresponds to \"Completion rate\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_VIEWERSHIP_COMPLETION_RATE"
        },
        {
            "description": "The number of times an error occurred, such as a VAST redirect error, a video playback error, or an invalid response error. Corresponds to \"Total error count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_VIEWERSHIP_TOTAL_ERROR_COUNT"
        },
        {
            "description": "Duration of the video creative. Corresponds to \"Video length\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_VIEWERSHIP_VIDEO_LENGTH"
        },
        {
            "description": "The number of times a skip button is shown in video. Corresponds to \"Skip button shown\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_VIEWERSHIP_SKIP_BUTTON_SHOWN"
        },
        {
            "description": "The number of engaged views i.e. ad is viewed to completion or for 30s, whichever comes first. Corresponds to \"Engaged view\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_VIEWERSHIP_ENGAGED_VIEW"
        },
        {
            "description": "View-through rate represented as a percentage. Corresponds to \"View-through rate\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_VIEWERSHIP_VIEW_THROUGH_RATE"
        },
        {
            "description": "Number of times that the publisher specified a video ad played automatically. Corresponds to \"Auto-plays\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_VIEWERSHIP_AUTO_PLAYS"
        },
        {
            "description": "Number of times that the publisher specified a video ad was clicked to play. Corresponds to \"Click-to-plays\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_VIEWERSHIP_CLICK_TO_PLAYS"
        },
        {
            "description": "Error rate is the percentage of video error count from (error count + total impressions). Corresponds to \"Total error rate\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_VIEWERSHIP_TOTAL_ERROR_RATE"
        },
        {
            "description": "Number of VAST video errors of type 100. Corresponds to \"VAST error 100 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_100_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 101. Corresponds to \"VAST error 101 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_101_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 102. Corresponds to \"VAST error 102 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_102_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 200. Corresponds to \"VAST error 200 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_200_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 201. Corresponds to \"VAST error 201 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_201_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 202. Corresponds to \"VAST error 202 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_202_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 203. Corresponds to \"VAST error 203 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_203_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 300. Corresponds to \"VAST error 300 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_300_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 301. Corresponds to \"VAST error 301 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_301_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 302. Corresponds to \"VAST error 302 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_302_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 303. Corresponds to \"VAST error 303 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_303_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 400. Corresponds to \"VAST error 400 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_400_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 401. Corresponds to \"VAST error 401 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_401_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 402. Corresponds to \"VAST error 402 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_402_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 403. Corresponds to \"VAST error 403 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_403_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 405. Corresponds to \"VAST error 405 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_405_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 500. Corresponds to \"VAST error 500 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_500_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 501. Corresponds to \"VAST error 501 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_501_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 502. Corresponds to \"VAST error 502 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_502_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 503. Corresponds to \"VAST error 503 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_503_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 600. Corresponds to \"VAST error 600 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_600_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 601. Corresponds to \"VAST error 601 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_601_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 602. Corresponds to \"VAST error 602 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_602_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 603. Corresponds to \"VAST error 603 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_603_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 604. Corresponds to \"VAST error 604 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_604_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 900. Corresponds to \"VAST error 900 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_900_COUNT"
        },
        {
            "description": "Number of VAST video errors of type 901. Corresponds to \"VAST error 901 count\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_ERRORS_VAST_ERROR_901_COUNT"
        },
        {
            "description": "Video interaction event: The number of times user paused ad clip. Corresponds to \"Pause\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_INTERACTION_PAUSE"
        },
        {
            "description": "Video interaction event: The number of times the user unpaused the video. Corresponds to \"Resume\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_INTERACTION_RESUME"
        },
        {
            "description": "Video interaction event: The number of times a user rewinds the video. Corresponds to \"Rewind\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_INTERACTION_REWIND"
        },
        {
            "description": "Video interaction event: The number of times video player was in mute state during play of ad clip. Corresponds to \"Mute\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_INTERACTION_MUTE"
        },
        {
            "description": "Video interaction event: The number of times a user unmutes the video. Corresponds to \"Unmute\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_INTERACTION_UNMUTE"
        },
        {
            "description": "Video interaction event: The number of times a user collapses a video, either to its original size or to a different size. Corresponds to \"Collapse\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_INTERACTION_COLLAPSE"
        },
        {
            "description": "Video interaction event: The number of times a user expands a video. Corresponds to \"Expand\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_INTERACTION_EXPAND"
        },
        {
            "description": "Video interaction event: The number of times ad clip played in full screen mode. Corresponds to \"Full screen\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_INTERACTION_FULL_SCREEN"
        },
        {
            "description": "Video interaction event: The number of user interactions with a video, on average, such as pause, full screen, mute, etc. Corresponds to \"Average interaction rate\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_INTERACTION_AVERAGE_INTERACTION_RATE"
        },
        {
            "description": "Video interaction event: The number of times a skippable video is skipped. Corresponds to \"Video skipped\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_INTERACTION_VIDEO_SKIPS"
        },
        {
            "description": "The number of control starts. Corresponds to \"Control starts\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_OPTIMIZATION_CONTROL_STARTS"
        },
        {
            "description": "The number of optimized starts. Corresponds to \"Optimized starts\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_OPTIMIZATION_OPTIMIZED_STARTS"
        },
        {
            "description": "The number of control completes. Corresponds to \"Control completes\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_OPTIMIZATION_CONTROL_COMPLETES"
        },
        {
            "description": "The number of optimized completes. Corresponds to \"Optimized completes\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_OPTIMIZATION_OPTIMIZED_COMPLETES"
        },
        {
            "description": "The rate of control completions. Corresponds to \"Control completion rate\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_OPTIMIZATION_CONTROL_COMPLETION_RATE"
        },
        {
            "description": "The rate of optimized completions. Corresponds to \"Optimized completion rate\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_OPTIMIZATION_OPTIMIZED_COMPLETION_RATE"
        },
        {
            "description": "The percentage by which optimized completion rate is greater than the unoptimized completion rate. This is calculated as (( Column.VIDEO_OPTIMIZATION_OPTIMIZED_COMPLETION_RATE/ Column.VIDEO_OPTIMIZATION_CONTROL_COMPLETION_RATE) - 1) * 100 for an ad for which the optimization feature has been enabled. Corresponds to \"Completion rate lift\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_OPTIMIZATION_COMPLETION_RATE_LIFT"
        },
        {
            "description": "The number of control skip buttons shown. Corresponds to \"Control skip button shown\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_OPTIMIZATION_CONTROL_SKIP_BUTTON_SHOWN"
        },
        {
            "description": "The number of optimized skip buttons shown. Corresponds to \"Optimized skip button shown\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_OPTIMIZATION_OPTIMIZED_SKIP_BUTTON_SHOWN"
        },
        {
            "description": "The number of control engaged views. Corresponds to \"Control engaged view\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_OPTIMIZATION_CONTROL_ENGAGED_VIEW"
        },
        {
            "description": "The number of optimized engaged views. Corresponds to \"Optimized engaged view\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_OPTIMIZATION_OPTIMIZED_ENGAGED_VIEW"
        },
        {
            "description": "The control view-through rate. Corresponds to \"Control view-through rate\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_OPTIMIZATION_CONTROL_VIEW_THROUGH_RATE"
        },
        {
            "description": "The optimized view-through rate. Corresponds to \"Optimized view-through rate\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_OPTIMIZATION_OPTIMIZED_VIEW_THROUGH_RATE"
        },
        {
            "description": "The percentage by which optimized view-through rate is greater than the unoptimized view-through rate. This is calculated as (( Column.VIDEO_OPTIMIZATION_OPTIMIZED_VIEW_THROUGH_RATE/ Column.VIDEO_OPTIMIZATION_CONTROL_VIEW_THROUGH_RATE) - 1) * 100 for an ad for which the optimization feature has been enabled. Corresponds to \"View-through rate lift\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIDEO_OPTIMIZATION_VIEW_THROUGH_RATE_LIFT"
        },
        {
            "description": "The total number of impressions viewed on the user's screen. Corresponds to \"Total Active View viewable impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_ACTIVE_VIEW_VIEWABLE_IMPRESSIONS"
        },
        {
            "description": "The total number of impressions that were sampled and measured by active view. Corresponds to \"Total Active View measurable impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_ACTIVE_VIEW_MEASURABLE_IMPRESSIONS"
        },
        {
            "description": "The percentage of total impressions viewed on the user's screen (out of the total impressions measurable by active view).",
            "dimension": "TOTAL_ACTIVE_VIEW_VIEWABLE_IMPRESSIONS_RATE"
        },
        {
            "description": "Total number of impressions that were eligible to measure viewability. Corresponds to \"Total Active View eligible impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_ACTIVE_VIEW_ELIGIBLE_IMPRESSIONS"
        },
        {
            "description": "The percentage of total impressions that were measurable by active view (out of all the total impressions sampled for active view). Corresponds to \"Total Active View % measurable impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_ACTIVE_VIEW_MEASURABLE_IMPRESSIONS_RATE"
        },
        {
            "description": "Active View total average time in seconds that specific impressions are reported as being viewable. Corresponds to \"Total Active View Average Viewable Time (seconds)\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_ACTIVE_VIEW_AVERAGE_VIEWABLE_TIME"
        },
        {
            "description": "The number of impressions delivered by the ad server viewed on the user's screen. Corresponds to \"Ad server Active View viewable impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_ACTIVE_VIEW_VIEWABLE_IMPRESSIONS"
        },
        {
            "description": "The number of impressions delivered by the ad server that were sampled, and measurable by active view. Corresponds to \"Ad server Active View measurable impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_ACTIVE_VIEW_MEASURABLE_IMPRESSIONS"
        },
        {
            "description": "The percentage of impressions delivered by the ad server viewed on the user's screen (out of the ad server impressions measurable by active view). Corresponds to \"Ad server Active View % viewable impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_ACTIVE_VIEW_VIEWABLE_IMPRESSIONS_RATE"
        },
        {
            "description": "Total number of impressions delivered by the ad server that were eligible to measure viewability. Corresponds to \"Ad server Active View eligible impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_ACTIVE_VIEW_ELIGIBLE_IMPRESSIONS"
        },
        {
            "description": "The percentage of impressions delivered by the ad server that were measurable by active view ( out of all the ad server impressions sampled for active view). Corresponds to \"Ad server Active View % measurable impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_ACTIVE_VIEW_MEASURABLE_IMPRESSIONS_RATE"
        },
        {
            "description": "Active View ad server revenue. Corresponds to \"Ad Server Active View Revenue\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_ACTIVE_VIEW_REVENUE"
        },
        {
            "description": "Active View ad server average time in seconds that specific impressions are reported as being viewable. Corresponds to \"Ad Server Active View Average Viewable Time (seconds)\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_SERVER_ACTIVE_VIEW_AVERAGE_VIEWABLE_TIME"
        },
        {
            "description": "The number of impressions delivered by AdSense viewed on the user's screen, Corresponds to \"AdSense Active View viewable impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "ADSENSE_ACTIVE_VIEW_VIEWABLE_IMPRESSIONS"
        },
        {
            "description": "The number of impressions delivered by AdSense that were sampled, and measurable by active view. Corresponds to \"AdSense Active View measurable impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "ADSENSE_ACTIVE_VIEW_MEASURABLE_IMPRESSIONS"
        },
        {
            "description": "The percentage of impressions delivered by AdSense viewed on the user's screen (out of AdSense impressions measurable by active view). Corresponds to \"AdSense Active View % viewable impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "ADSENSE_ACTIVE_VIEW_VIEWABLE_IMPRESSIONS_RATE"
        },
        {
            "description": "Total number of impressions delivered by AdSense that were eligible to measure viewability. Corresponds to \"AdSense Active View eligible impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "ADSENSE_ACTIVE_VIEW_ELIGIBLE_IMPRESSIONS"
        },
        {
            "description": "The percentage of impressions delivered by AdSense that were measurable by active view ( out of all AdSense impressions sampled for active view). Corresponds to \"AdSense Active View % measurable impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "ADSENSE_ACTIVE_VIEW_MEASURABLE_IMPRESSIONS_RATE"
        },
        {
            "description": "Active View AdSense revenue. Corresponds to \"AdSense Active View Revenue\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "ADSENSE_ACTIVE_VIEW_REVENUE"
        },
        {
            "description": "Active View AdSense average time in seconds that specific impressions are reported as being viewable. Corresponds to \"AdSense Active View Average Viewable Time (seconds)\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "ADSENSE_ACTIVE_VIEW_AVERAGE_VIEWABLE_TIME"
        },
        {
            "description": "The number of impressions delivered by Ad Exchange viewed on the user's screen, Corresponds to \"Ad Exchange Active View viewable impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_EXCHANGE_ACTIVE_VIEW_VIEWABLE_IMPRESSIONS"
        },
        {
            "description": "The number of impressions delivered by Ad Exchange that were sampled, and measurable by active view. Corresponds to \"Ad Exchange Active View measurable impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_EXCHANGE_ACTIVE_VIEW_MEASURABLE_IMPRESSIONS"
        },
        {
            "description": "The percentage of impressions delivered by Ad Exchange viewed on the user's screen (out of Ad Exchange impressions measurable by active view). Corresponds to \"Ad Exchange Active View % viewable impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_EXCHANGE_ACTIVE_VIEW_VIEWABLE_IMPRESSIONS_RATE"
        },
        {
            "description": "Total number of impressions delivered by Ad Exchange that were eligible to measure viewability. Corresponds to \"Ad Exchange Active View eligible impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_EXCHANGE_ACTIVE_VIEW_ELIGIBLE_IMPRESSIONS"
        },
        {
            "description": "The percentage of impressions delivered by Ad Exchange that were measurable by active view ( out of all Ad Exchange impressions sampled for active view). Corresponds to \"Ad Exchange Active View % measurable impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_EXCHANGE_ACTIVE_VIEW_MEASURABLE_IMPRESSIONS_RATE"
        },
        {
            "description": "Active View AdExchange revenue. Corresponds to \"Ad Exchange Active View Revenue\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_EXCHANGE_ACTIVE_VIEW_REVENUE"
        },
        {
            "description": "Active View AdExchange average time in seconds that specific impressions are reported as being viewable. Corresponds to \"Ad Exchange Active View Average Viewable Time (seconds)\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "AD_EXCHANGE_ACTIVE_VIEW_AVERAGE_VIEWABLE_TIME"
        },
        {
            "description": "Active View total revenue. Corresponds to \"Total Active View Revenue\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_ACTIVE_VIEW_REVENUE"
        },
        {
            "description": "Number of view-through conversions.",
            "dimension": "VIEW_THROUGH_CONVERSIONS"
        },
        {
            "description": "Number of view-through conversions per thousand impressions. Corresponds to \"Conversions per thousand impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "CONVERSIONS_PER_THOUSAND_IMPRESSIONS"
        },
        {
            "description": "Number of click-through conversions. Corresponds to \"Click-through conversions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "CLICK_THROUGH_CONVERSIONS"
        },
        {
            "description": "Number of click-through conversions per click. Corresponds to \"Conversions per click\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "CONVERSIONS_PER_CLICK"
        },
        {
            "description": "Revenue for view-through conversions. Corresponds to \"Advertiser view-through sales\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "VIEW_THROUGH_REVENUE"
        },
        {
            "description": "Revenue for click-through conversions. Corresponds to \"Advertiser click-through sales\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "CLICK_THROUGH_REVENUE"
        },
        {
            "description": "Total number of conversions. Corresponds to \"Total conversions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_CONVERSIONS"
        },
        {
            "description": "Total revenue for conversions. Corresponds to \"Total advertiser sales\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "TOTAL_CONVERSION_REVENUE"
        },
        {
            "description": "The number of impressions sent to Ad Exchange / AdSense, regardless of whether they won or lost (total number of dynamic allocation impressions). Corresponds to \"Impressions competing\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "DYNAMIC_ALLOCATION_OPPORTUNITY_IMPRESSIONS_COMPETING_TOTAL"
        },
        {
            "description": "The number of unfilled queries that attempted dynamic allocation by Ad Exchange / AdSense. Corresponds to \"Unfilled competing impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "DYNAMIC_ALLOCATION_OPPORTUNITY_UNFILLED_IMPRESSIONS_COMPETING"
        },
        {
            "description": "The number of Ad Exchange / AdSense and Ad Manager impressions. Corresponds to \"Eligible impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "DYNAMIC_ALLOCATION_OPPORTUNITY_ELIGIBLE_IMPRESSIONS_TOTAL"
        },
        {
            "description": "The difference between eligible impressions and competing impressions in dynamic allocation.",
            "dimension": "DYNAMIC_ALLOCATION_OPPORTUNITY_IMPRESSIONS_NOT_COMPETING_TOTAL"
        },
        {
            "description": "The percentage of eligible impressions that are not competing in dynamic allocation. Corresponds to \"Impressions not competing (%)\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "DYNAMIC_ALLOCATION_OPPORTUNITY_IMPRESSIONS_NOT_COMPETING_PERCENT_TOTAL"
        },
        {
            "description": "The percent of eligible impressions participating in dynamic allocation.",
            "dimension": "DYNAMIC_ALLOCATION_OPPORTUNITY_SATURATION_RATE_TOTAL"
        },
        {
            "description": "The percent of total dynamic allocation queries that won. Corresponds to \"Dynamic allocation match rate\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "DYNAMIC_ALLOCATION_OPPORTUNITY_MATCH_RATE_TOTAL"
        },
        {
            "description": "The number of invoiced impressions. Corresponds to \"Invoiced impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "INVOICED_IMPRESSIONS"
        },
        {
            "description": "The number of invoiced unfilled impressions. Corresponds to \"Invoiced unfilled impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "INVOICED_UNFILLED_IMPRESSIONS"
        },
        {
            "description": "The total number of impressions tracked for Nielsen Digital Ad Ratings measurement. Corresponds to \"Impressions\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_IMPRESSIONS"
        },
        {
            "description": "The total number of impressions for in-target demographic tracked for Nielsen Digital Ad Ratings measurement. Corresponds to \"In-target impressions\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_IN_TARGET_IMPRESSIONS"
        },
        {
            "description": "The population in the demographic. Corresponds to \"Population base\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_POPULATION_BASE"
        },
        {
            "description": "The total population for all in-target demographics. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_IN_TARGET_POPULATION_BASE"
        },
        {
            "description": "The total number of different people within the selected demographic who were reached. Corresponds to \"Unique audience\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_UNIQUE_AUDIENCE"
        },
        {
            "description": "The total number of different people within all in-target demographics who were reached. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_IN_TARGET_UNIQUE_AUDIENCE"
        },
        {
            "description": "The unique audience reached as a percentage of the population base. Corresponds to \"% audience reach\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_PERCENT_AUDIENCE_REACH"
        },
        {
            "description": "The unique audience reached as a percentage of the population base for all in-target demographics. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_IN_TARGET_PERCENT_AUDIENCE_REACH"
        },
        {
            "description": "The average number of times that a person within the target audience sees an advertisement. Corresponds to \"Average frequency\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_AVERAGE_FREQUENCY"
        },
        {
            "description": "The average number of times that a person within the target audience sees an advertisement for all in-target demographics. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_IN_TARGET_AVERAGE_FREQUENCY"
        },
        {
            "description": "The unit of audience volume, which is based on the percentage of the reached target audience population multiplied by the average frequency. Corresponds to \"Gross rating points\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_GROSS_RATING_POINTS"
        },
        {
            "description": "The unit of audience volume, which is based on the percentage of the reached target audience population multiplied by the average frequency, for all in-target demographics. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_IN_TARGET_GROSS_RATING_POINTS"
        },
        {
            "description": "The share of impressions that reached the target demographic. Corresponds to \"% impression share\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_PERCENT_IMPRESSIONS_SHARE"
        },
        {
            "description": "The share of impressions that reached all in-target demographics. Corresponds to \"In-target % impression share\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_IN_TARGET_PERCENT_IMPRESSIONS_SHARE"
        },
        {
            "description": "The share of the total population represented by the population base. Corresponds to \"% population share\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_PERCENT_POPULATION_SHARE"
        },
        {
            "description": "The share of the total population for all in-target demographics represented by the population base. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_IN_TARGET_PERCENT_POPULATION_SHARE"
        },
        {
            "description": "The share of the unique audience in the demographic. Corresponds to \"% audience share\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_PERCENT_AUDIENCE_SHARE"
        },
        {
            "description": "The share of the unique audience for all in-target demographics. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_IN_TARGET_PERCENT_AUDIENCE_SHARE"
        },
        {
            "description": "The relative unique audience in the demographic compared with its share of the overall population. Corresponds to \"Audience index\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_AUDIENCE_INDEX"
        },
        {
            "description": "The relative unique audience for all in-target demographics compared with its share of the overall population. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_IN_TARGET_AUDIENCE_INDEX"
        },
        {
            "description": "The relative impressions per person in the demographic compared with the impressions per person for the overall population. Corresponds to \"Impressions index\" in the Ad Manager UI. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_IMPRESSIONS_INDEX"
        },
        {
            "description": "The relative impressions per person for all in-target demographics compared with the impressions per person for the overall population. Compatible with the \"Reach\" report type.",
            "dimension": "NIELSEN_IN_TARGET_IMPRESSIONS_INDEX"
        },
        {
            "description": "Number of impressions delivered. Corresponds to \"Impressions\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_IMPRESSIONS"
        },
        {
            "description": "Number of clicks delivered Corresponds to \"Clicks\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_CLICKS"
        },
        {
            "description": "Number of requests. Corresponds to \"Queries\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_QUERIES"
        },
        {
            "description": "Number of requests where a buyer was matched with the Ad request. Corresponds to \"Matched queries\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_MATCHED_QUERIES"
        },
        {
            "description": "The revenue earned, calculated in publisher currency, for the ads delivered. Corresponds to \"Cost\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_COST"
        },
        {
            "description": "Total number of impressions delivered by the ad server that were eligible to measure viewability. Corresponds to \"Total Active View eligible impressions\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_ACTIVE_VIEW_ELIGIBLE_IMPRESSIONS"
        },
        {
            "description": "The number of impressions delivered that were sampled and measurable by active view. Corresponds to \"Total Active View measurable impressions\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_ACTIVE_VIEW_MEASURABLE_IMPRESSIONS"
        },
        {
            "description": "The number of impressions delivered that were viewed on the user's screen. Corresponds to \"Total Active View viewable impressions\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_ACTIVE_VIEW_VIEWABLE_IMPRESSIONS"
        },
        {
            "description": "The percentage of impressions delivered that were measurable by active view (out of all the impressions sampled for active view). Corresponds to \"Total Active View % measurable impressions\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_ACTIVE_VIEW_MEASURABLE_IMPRESSIONS_RATE"
        },
        {
            "description": "The percentage of impressions delivered thar were viewed on the user's screen (out of the impressions measurable by active view). Corresponds to \"Total Active View % viewable impressions\" in the Ad Manager UI. Compatible with the \"Ad Connector\" report type.",
            "dimension": "DP_ACTIVE_VIEW_VIEWABLE_IMPRESSIONS_RATE"
        },
        {
            "description": "The host impressions in the partner management. Corresponds to \"Host impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "PARTNER_MANAGEMENT_HOST_IMPRESSIONS"
        },
        {
            "description": "The host clicks in the partner management. Corresponds to \"Host clicks\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "PARTNER_MANAGEMENT_HOST_CLICKS"
        },
        {
            "description": "The host CTR in the partner management. Corresponds to \"Host CTR\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "PARTNER_MANAGEMENT_HOST_CTR"
        },
        {
            "description": "The unfilled impressions in the partner management. Corresponds to \"Unfilled impressions\" in the Ad Manager UI. Compatible with any of the following report types: Historical, Partner finance.",
            "dimension": "PARTNER_MANAGEMENT_UNFILLED_IMPRESSIONS"
        },
        {
            "description": "The partner impressions in the partner management. Corresponds to \"Partner impressions\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "PARTNER_MANAGEMENT_PARTNER_IMPRESSIONS"
        },
        {
            "description": "The partner clicks in the partner management. Corresponds to \"Partner clicks\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "PARTNER_MANAGEMENT_PARTNER_CLICKS"
        },
        {
            "description": "The partner CTR in the partner management. Corresponds to \"Partner CTR\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "PARTNER_MANAGEMENT_PARTNER_CTR"
        },
        {
            "description": "The gross revenue in the partner management. Corresponds to \"Gross revenue\" in the Ad Manager UI. Compatible with the \"Historical\" report type.",
            "dimension": "PARTNER_MANAGEMENT_GROSS_REVENUE"
        },
        {
            "description": "Monthly host impressions for partner finance reports. Corresponds to \"Host impressions\" in the Ad Manager UI. Compatible with the \"Partner finance\" report type.",
            "dimension": "PARTNER_FINANCE_HOST_IMPRESSIONS"
        },
        {
            "description": "Monthly host revenue for partner finance reports. Corresponds to \"Host revenue\" in the Ad Manager UI. Compatible with the \"Partner finance\" report type.",
            "dimension": "PARTNER_FINANCE_HOST_REVENUE"
        },
        {
            "description": "Monthly host eCPM for partner finance reports. Corresponds to \"Host eCPM\" in the Ad Manager UI. Compatible with the \"Partner finance\" report type.",
            "dimension": "PARTNER_FINANCE_HOST_ECPM"
        },
        {
            "description": "Monthly partner revenue for partner finance reports. Corresponds to \"Partner revenue\" in the Ad Manager UI. Compatible with the \"Partner finance\" report type.",
            "dimension": "PARTNER_FINANCE_PARTNER_REVENUE"
        },
        {
            "description": "Monthly partner eCPM for partner finance reports. Corresponds to \"Partner eCPM\" in the Ad Manager UI. Compatible with the \"Partner finance\" report type.",
            "dimension": "PARTNER_FINANCE_PARTNER_ECPM"
        },
        {
            "description": "Monthly gross revenue for partner finance reports. Corresponds to \"Gross revenue\" in the Ad Manager UI. Compatible with the \"Partner finance\" report type.",
            "dimension": "PARTNER_FINANCE_GROSS_REVENUE"
        }
    ],
    "ad_unit_views": [
        {
            "description": "Only the top level ad units. Metrics include events for their descendants that are not filtered out.",
            "dimension": "TOP_LEVEL"
        },
        {
            "description": "All the ad units. Metrics do not include events for the descendants.",
            "dimension": "FLAT"
        },
        {
            "description": "Use the ad unit hierarchy. There will be as many ad unit columns as levels of ad units in the generated report: The column Dimension.AD_UNIT_NAME is replaced with columns \"Ad unit 1\", \"Ad unit 2\", ... \"Ad unit n\". If level is not applicable to a row, \"N/A\" is returned as the value. The column Dimension.AD_UNIT_ID is replaced with columns \"Ad unit ID 1\", \"Ad unit ID 2\", ... \"Ad unit ID n\". If level is not applicable to a row, \"N/A\" is returned as the value. Metrics do not include events for the descendants.",
            "dimension": "HIERARCHICAL"
        }
    ]
}
